[
  {
    "url": "200Cheh.php",
    "textArr": [
      "The Waterfalls of The State of Selangor has a state boundary at the western slopes of the Main Range.\nThe annual Monsoon rains and tropical storms results in major rivers with many tributaries and waterfalls. \nRainfall level is fairly consistent on this windward side of the Main Range. \nHence, the size of waterfalls found in Selangor varies not much in size the whole year round.\n   \n   \n\n\n\t   Accessability: Easy\n\t   \n\t   Picture\n\t   Name/Location\n\t   Type\n\t   Activities\n\t   Description\n\t   \n\t  \n\t  Cheh Cascade FallUlu Yam Bahru, Batang Kali\n\t  Cascades\n\t  PicnicCamping\n\t  Small cascade fall near a camping resortLast update March 2022\n\t \n\t  \n\t  Gabai FallsHulu Langat\n\t  Multiple falls\n\t  PicnicSwimming\n\t  This is a popular waterfall, suitable for families, can be crowded during weekendsLast update June 2004\n\t \n\t  \n\t  Jeram Anjang FallHulu Langat\n\t  Single fall\n\t  PicnicCamping\n\t  Private land accessLast update October 2021\n\t \n\t  \n\t  Kanching FallsBetween Selayang and Rawang\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekking\n\t  This recreation park is within easy access from KL. The lower part is easy, suitable for families. The upper falls require trekking. Last update December 2010\n\t \n\t  \n\t  Komanwel FallBetween KL and Rawang\n\t  Single fall\n\t  PicnicTrekking\n\t  Small waterfall in quiet surroundingsLast update September 2009\n\t \n\t  \n\t  Perigi TujuhNorth of Rawang, near Serendah\n\t  Single fall\n\t  Picnic\n\t  Not a real waterfall anymore. It has been replaced by seven \"wells\" and a dam. The effect, however is quite picturesqueLast update December 2003\n\t \n\t  \n\t  Sendat Falls5 km from  Ulu Yam Baharu\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekkingCamping\n\t  Still unspoilt, but for how long?\nLast update April 2005\n\t \n\t  \n\t  Serendah Fallnear Serendah\n\t  CascadesSingle fall\n\t  PicnicSwimming\n\t  A beautiful vertical drop.\nBut ruined by developers....\nLast update April 2010\n\t \n\t  \n\t  Sungei TuaNear Selayang\n\t  RapidsCascadesSingle fall\n\t  PicnicSwimmingCamping\n\t  A couple of nice waterfalls besides the road. Recreation park on the other side of the roadLast update April 2005\n\t \n\t  \n\t  Tekala Fallsnear the Semenyih Dam\n\t  CascadesMultiple falls\n\t  PicnicSwimming\n\t  A popular recreation park in Hulu Langat. Suitable for familiesLast update June 2004\n\t \n\t   Accessability: Moderate\n\t   \n\t   Picture\n\t   Name/Location\n\t   Type\n\t   Activities\n\t   Description\n\t   \n\t  \n\t  Batangsi Fallnear Semenyih\n\t  RapidsCascades\n\t  SwimmingTrekking\n\t  Cascades and rapids in the Sungei Batangsi. Last update April 2010\n\t \n\t  \n\t  Batu Asah FallsAmpang, Near KL\n\t  CascadesMultiple falls\n\t  SwimmingTrekking\n\t  A series of 6 small waterfalls near Zoo NegaraLast update March 2022\n\t \n\t  \n\t  Batu Berayun FallBatang Kali\n\t  CascadesSingle fall\n\t  Trekking\n\t  A long hike and virtually unknown waterfallLast update September 2021\n\t \n\t  \n\t  Batu Bertengkek FallsKerling, Hulu Selangor\n\t  Multiple falls\n\t  Trekking\n\t  A rare contrast of a tall & a wide fall within stone throw reach of each other. Features unique rock boulders.Last update April 2021\n\t \n\t  \n\t  Batu Cherandong Dam FallsKuala Kubu Baru\n\t  RapidsCascadesMultiple falls\n\t  PicnicSwimmingTrekkingCamping\n\t  A pre-independence water catchment dam fall with several smaller natural waterfalls on the same streamLast update April 2022\n\t \n\t  \n\t  Batu Kapal FallsNorth Batu Caves\n\t  CascadesMultiple falls\n\t  Trekking\n\t  A waterfall with an impressively large \"ship\" shaped boulder. Virtually unknown.Last update March 2021\n\t \n\t  \n\t  Bukit Apeh FallUlu Langat FR, access from Cheras\n\t  Multiple falls\n\t  PicnicSwimmingTrekking\n\t  Attractive fall, near to the townLast update January 2009\n\t \n\t  \n\t  Chiling FallsBetween KKB and the Gap\n\t  Multiple falls\n\t  SwimmingTrekkingCamping\n\t  A beautiful fall at the end of an interesting river trekking, during which you have to cross the river several timesLast update August 2015\n\t \n\t  \n\t  Gapi FallAntara Gapi, Hulu Selangor\n\t  Single fall\n\t  Trekking\n\t  Scenic & tall waterfall. Majestic during wet seasons.Last update December 2021\n\t \n\t  \n\t  Gapok FallsKg. Paya Lebar, Hulu Langat\n\t  Multiple falls\n\t  Trekking\n\t  Waterfall series with 11 falls of different presentation. popular during weekends.Last update October 2021\n\t \n\t  \n\t  Jeram PerlusUlu Langat region\n\t  Single fall\n\t  PicnicSwimmingTrekking\n\t  Unspoilt waterfallLast update May 2008\n\t \n\t  \n\t  Kedondong FallAlongside the road between Batang Kali and Gohtong Jaya\n\t  CascadesSingle fall\n\t  PicnicSwimmingTrekking\n\t  Unknown waterfall near popular recreation parkLast update March 2009\n\t \n\t  \n\t  Lata Beringin FallsHulu Langat\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekkingCamping\n\t  Interesting multi-level falls beside a river campsiteLast update April 2022\n\t \n\t  \n\t  Lata MedangNear Kg Pertak\n\t  CascadesMultiple falls\n\t  SwimmingTrekkingCamping\n\t  Remote waterfall. Pristine and unspoiltLast update December 2011\n\t \n\t  \n\t  Lawing FallsNear Kg Sg Lui, Ulu Langat region\n\t  CascadesMultiple falls\n\t  SwimmingTrekking\n\t  Unknown, pristine waterfall in the backyard of KLLast update November 2009\n\t \n\t  \n\t  Lepok Fallin Ulu Langat, near Kg Pangsun\n\t  Single fall\n\t  SwimmingTrekkingCamping\n\t  Lonely,beautiful fall in Ulu Langat. A two hour trek is needed, worth the effortLast update June 2004\n\t \n\t  \n\t  Lolo FallsNear Kg Pangsun\n\t  Multiple falls\n\t  SwimmingTrekking\n\t  Two unspoilt waterfalls, Bomoh Ali and Berembun. You must be able to swim to reach Berembun.Last update May 2013\n\t \n\t  \n\t  Lubuk Kawah FallNear Tanjung Malim\n\t  CascadesMultiple falls\n\t  SwimmingTrekkingCamping\n\t  Pristine fall in Ulu Bernam. Guide neededLast update June 2009\n\t \n\t  \n\t  Masai FallsNear Semenyih\n\t  CascadesMultiple falls\n\t  Trekking\n\t  Unconventional cascade falls series in pristine jungleLast update August 2021\n\t \n\t  \n\t  Pangsun FallKg. Kuala Pangsun, Hulu Langat\n\t  CascadesSingle fall\n\t  Trekking\n\t  Small waterfall upriver of old hydro damLast update November 2019\n\t \n\t  \n\t  Perdik FallUlu Langat region\n\t  Multiple falls\n\t  Trekking\n\t  Small, unknown waterfall in the Ulu Langat regionLast update January 2010\n\t \n\t  \n\t  Pisang FallNear Gombak and the Karak Highway\n\t  Single fall\n\t  SwimmingTrekkingCamping\n\t  Nice small waterfall, reachable from the Karak highway (easy) or after a trek from the old Gombak RoadLast update November 2003\n\t \n\t  \n\t  Setinggi FallBetween Rawang and Serendah\n\t  Multiple falls\n\t  SwimmingTrekking\n\t  Unspoilt waterfallLast update November 2011\n\t \n\t  \n\t  Sg Ampang FallsUlu Klang, near KL\n\t  Multiple falls\n\t  SwimmingTrekking\n\t  Unspoilt waterfalls in scenic surroundings. The first fall also known as Kemansah Fall\nLast update May 2011\n\t \n\t  \n\t  Sg Luit FallsNear Kg Pertak\n\t  CascadesMultiple falls\n\t  SwimmingTrekkingCamping\n\t  Remote, powerful fall. Long access trailLast update February 2012\n\t \n\t  \n\t  Siong FallSemenyih Dam to Negri Sembilan\n\t  Single fall\n\t  Trekking\n\t  The tall cascade can be seen from the main road. An Orang Asli guide is advisable. Pristine conditionsLast update September 2004\n\t \n\t  \n\t  Tarun FallsNear Broga\n\t  Multiple falls\n\t  Trekking\n\t  A majestic falls, can be seasonal during low rainfall.Last update December 2021\n\t \n\t  \n\t  Templer FallsBetween KL and Rawang\n\t  CascadesSingle fall\n\t  PicnicTrekkingCamping\n\t  A nice family site, near to the better known Kanching FallsLast update May 2022\n\t \n\t  \n\t  Ulu Tamu FallsNear Batang Kali\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekking\n\t  Unspoilt falls in the backyard of Batang KaliLast update February 2012\n\t \n\n\n\trmb_ki101('79qfmgtj4fu','','26','26',1,'ffffff','010020','00fff6');\nEasyPictureName/LocationTypeActivitiesDescriptionCheh Cascade FallUlu Yam Bahru, Batang KaliCheh Cascade FallUlu Yam Bahru, Batang KaliCascadesPicnicCampingSmall cascade fall near a camping resortLast update March 2022Last update March 2022Last update March 2022Gabai FallsHulu LangatGabai FallsHulu LangatMultiple fallsPicnicSwimmingThis is a popular waterfall, suitable for families, can be crowded during weekendsLast update June 2004Last update June 2004Last update June 2004Jeram Anjang FallHulu LangatJeram Anjang FallHulu LangatSingle fallPicnicCampingPrivate land accessLast update October 2021Last update October 2021Last update October 2021Kanching FallsBetween Selayang and RawangKanching FallsBetween Selayang and RawangCascadesMultiple fallsPicnicSwimmingTrekkingThis recreation park is within easy access from KL. The lower part is easy, suitable for families. The upper falls require trekking. Last update December 2010Last update December 2010Last update December 2010Komanwel FallBetween KL and RawangKomanwel FallBetween KL and RawangSingle fallPicnicTrekkingSmall waterfall in quiet surroundingsLast update September 2009Last update September 2009Last update September 2009Perigi TujuhNorth of Rawang, near SerendahPerigi TujuhNorth of Rawang, near SerendahSingle fallPicnicNot a real waterfall anymore. It has been replaced by seven \"wells\" and a dam. The effect, however is quite picturesqueLast update December 2003Last update December 2003Last update December 2003Sendat Falls5 km from  Ulu Yam BaharuSendat Falls5 km from  Ulu Yam BaharuCascadesMultiple fallsPicnicSwimmingTrekkingCampingStill unspoilt, but for how long?\nLast update April 2005Last update April 2005Last update April 2005Serendah Fallnear SerendahSerendah Fallnear SerendahCascadesSingle fallPicnicSwimmingA beautiful vertical drop.\nBut ruined by developers....\nLast update April 2010Last update April 2010Last update April 2010Sungei TuaNear SelayangSungei TuaNear SelayangRapidsCascadesSingle fallPicnicSwimmingCampingA couple of nice waterfalls besides the road. Recreation park on the other side of the roadLast update April 2005Last update April 2005Last update April 2005Tekala Fallsnear the Semenyih DamTekala Fallsnear the Semenyih DamCascadesMultiple fallsPicnicSwimmingA popular recreation park in Hulu Langat. Suitable for familiesLast update June 2004Last update June 2004Last update June 2004ModeratePictureName/LocationTypeActivitiesDescriptionBatangsi Fallnear SemenyihBatangsi Fallnear SemenyihRapidsCascadesSwimmingTrekkingCascades and rapids in the Sungei Batangsi. Last update April 2010Last update April 2010Last update April 2010Batu Asah FallsAmpang, Near KLBatu Asah FallsAmpang, Near KLCascadesMultiple fallsSwimmingTrekkingA series of 6 small waterfalls near Zoo NegaraLast update March 2022Last update March 2022Last update March 2022Batu Berayun FallBatang KaliBatu Berayun FallBatang KaliCascadesSingle fallTrekkingA long hike and virtually unknown waterfallLast update September 2021Last update September 2021Last update September 2021Batu Bertengkek FallsKerling, Hulu SelangorBatu Bertengkek FallsKerling, Hulu SelangorMultiple fallsTrekkingA rare contrast of a tall & a wide fall within stone throw reach of each other. Features unique rock boulders.Last update April 2021Last update April 2021Last update April 2021Batu Cherandong Dam FallsKuala Kubu BaruBatu Cherandong Dam FallsKuala Kubu BaruRapidsCascadesMultiple fallsPicnicSwimmingTrekkingCampingA pre-independence water catchment dam fall with several smaller natural waterfalls on the same streamLast update April 2022Last update April 2022Last update April 2022Batu Kapal FallsNorth Batu CavesBatu Kapal FallsNorth Batu CavesCascadesMultiple fallsTrekkingA waterfall with an impressively large \"ship\" shaped boulder. Virtually unknown.Last update March 2021Last update March 2021Last update March 2021Bukit Apeh FallUlu Langat FR, access from CherasBukit Apeh FallUlu Langat FR, access from CherasMultiple fallsPicnicSwimmingTrekkingAttractive fall, near to the townLast update January 2009Last update January 2009Last update January 2009Chiling FallsBetween KKB and the GapChiling FallsBetween KKB and the GapMultiple fallsSwimmingTrekkingCampingA beautiful fall at the end of an interesting river trekking, during which you have to cross the river several timesLast update August 2015Last update August 2015Last update August 2015Gapi FallAntara Gapi, Hulu SelangorGapi FallAntara Gapi, Hulu SelangorSingle fallTrekkingScenic & tall waterfall. Majestic during wet seasons.Last update December 2021Last update December 2021Last update December 2021Gapok FallsKg. Paya Lebar, Hulu LangatGapok FallsKg. Paya Lebar, Hulu LangatMultiple fallsTrekkingWaterfall series with 11 falls of different presentation. popular during weekends.Last update October 2021Last update October 2021Last update October 2021Jeram PerlusUlu Langat regionJeram PerlusUlu Langat regionSingle fallPicnicSwimmingTrekkingUnspoilt waterfallLast update May 2008Last update May 2008Last update May 2008Kedondong FallAlongside the road between Batang Kali and Gohtong JayaKedondong FallAlongside the road between Batang Kali and Gohtong JayaCascadesSingle fallPicnicSwimmingTrekkingUnknown waterfall near popular recreation parkLast update March 2009Last update March 2009Last update March 2009Lata Beringin FallsHulu LangatLata Beringin FallsHulu LangatCascadesMultiple fallsPicnicSwimmingTrekkingCampingInteresting multi-level falls beside a river campsiteLast update April 2022Last update April 2022Last update April 2022Lata MedangNear Kg PertakLata MedangNear Kg PertakCascadesMultiple fallsSwimmingTrekkingCampingRemote waterfall. Pristine and unspoiltLast update December 2011Last update December 2011Last update December 2011Lawing FallsNear Kg Sg Lui, Ulu Langat regionLawing FallsNear Kg Sg Lui, Ulu Langat regionCascadesMultiple fallsSwimmingTrekkingUnknown, pristine waterfall in the backyard of KLLast update November 2009Last update November 2009Last update November 2009Lepok Fallin Ulu Langat, near Kg PangsunLepok Fallin Ulu Langat, near Kg PangsunSingle fallSwimmingTrekkingCampingLonely,beautiful fall in Ulu Langat. A two hour trek is needed, worth the effortLast update June 2004Last update June 2004Last update June 2004Lolo FallsNear Kg PangsunLolo FallsNear Kg PangsunMultiple fallsSwimmingTrekkingTwo unspoilt waterfalls, Bomoh Ali and Berembun. You must be able to swim to reach Berembun.Last update May 2013Last update May 2013Last update May 2013Lubuk Kawah FallNear Tanjung MalimLubuk Kawah FallNear Tanjung MalimCascadesMultiple fallsSwimmingTrekkingCampingPristine fall in Ulu Bernam. Guide neededLast update June 2009Last update June 2009Last update June 2009Masai FallsNear SemenyihMasai FallsNear SemenyihCascadesMultiple fallsTrekkingUnconventional cascade falls series in pristine jungleLast update August 2021Last update August 2021Last update August 2021Pangsun FallKg. Kuala Pangsun, Hulu LangatPangsun FallKg. Kuala Pangsun, Hulu LangatCascadesSingle fallTrekkingSmall waterfall upriver of old hydro damLast update November 2019Last update November 2019Last update November 2019Perdik FallUlu Langat regionPerdik FallUlu Langat regionMultiple fallsTrekkingSmall, unknown waterfall in the Ulu Langat regionLast update January 2010Last update January 2010Last update January 2010Pisang FallNear Gombak and the Karak HighwayPisang FallNear Gombak and the Karak HighwaySingle fallSwimmingTrekkingCampingNice small waterfall, reachable from the Karak highway (easy) or after a trek from the old Gombak RoadLast update November 2003Last update November 2003Last update November 2003Setinggi FallBetween Rawang and SerendahSetinggi FallBetween Rawang and SerendahMultiple fallsSwimmingTrekkingUnspoilt waterfallLast update November 2011Last update November 2011Last update November 2011Sg Ampang FallsUlu Klang, near KLSg Ampang FallsUlu Klang, near KLMultiple fallsSwimmingTrekkingUnspoilt waterfalls in scenic surroundings. The first fall also known as Kemansah Fall\nLast update May 2011Last update May 2011Last update May 2011Sg Luit FallsNear Kg PertakSg Luit FallsNear Kg PertakCascadesMultiple fallsSwimmingTrekkingCampingRemote, powerful fall. Long access trailLast update February 2012Last update February 2012Last update February 2012Siong FallSemenyih Dam to Negri SembilanSiong FallSemenyih Dam to Negri SembilanSingle fallTrekkingThe tall cascade can be seen from the main road. An Orang Asli guide is advisable. Pristine conditionsLast update September 2004Last update September 2004Last update September 2004Tarun FallsNear BrogaTarun FallsNear BrogaMultiple fallsTrekkingA majestic falls, can be seasonal during low rainfall.Last update December 2021Last update December 2021Last update December 2021Templer FallsBetween KL and RawangTempler FallsBetween KL and RawangCascadesSingle fallPicnicTrekkingCampingA nice family site, near to the better known Kanching FallsLast update May 2022Last update May 2022Last update May 2022Ulu Tamu FallsNear Batang KaliUlu Tamu FallsNear Batang KaliCascadesMultiple fallsPicnicSwimmingTrekkingUnspoilt falls in the backyard of Batang KaliLast update February 2012Last update February 2012Last update February 2012"
    ],
    "img": "https://waterfallsofmalaysia.com/images/waterfalls01_small.jpg"
  },
  {
    "url": "200Cheh.php",
    "textArr": [
      "The Waterfalls of The State of Selangor has a state boundary at the western slopes of the Main Range.\nThe annual Monsoon rains and tropical storms results in major rivers with many tributaries and waterfalls. \nRainfall level is fairly consistent on this windward side of the Main Range. \nHence, the size of waterfalls found in Selangor varies not much in size the whole year round.\n   \n   \n\n\n\t   Accessability: Easy\n\t   \n\t   Picture\n\t   Name/Location\n\t   Type\n\t   Activities\n\t   Description\n\t   \n\t  \n\t  Cheh Cascade FallUlu Yam Bahru, Batang Kali\n\t  Cascades\n\t  PicnicCamping\n\t  Small cascade fall near a camping resortLast update March 2022\n\t \n\t  \n\t  Gabai FallsHulu Langat\n\t  Multiple falls\n\t  PicnicSwimming\n\t  This is a popular waterfall, suitable for families, can be crowded during weekendsLast update June 2004\n\t \n\t  \n\t  Jeram Anjang FallHulu Langat\n\t  Single fall\n\t  PicnicCamping\n\t  Private land accessLast update October 2021\n\t \n\t  \n\t  Kanching FallsBetween Selayang and Rawang\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekking\n\t  This recreation park is within easy access from KL. The lower part is easy, suitable for families. The upper falls require trekking. Last update December 2010\n\t \n\t  \n\t  Komanwel FallBetween KL and Rawang\n\t  Single fall\n\t  PicnicTrekking\n\t  Small waterfall in quiet surroundingsLast update September 2009\n\t \n\t  \n\t  Perigi TujuhNorth of Rawang, near Serendah\n\t  Single fall\n\t  Picnic\n\t  Not a real waterfall anymore. It has been replaced by seven \"wells\" and a dam. The effect, however is quite picturesqueLast update December 2003\n\t \n\t  \n\t  Sendat Falls5 km from  Ulu Yam Baharu\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekkingCamping\n\t  Still unspoilt, but for how long?\nLast update April 2005\n\t \n\t  \n\t  Serendah Fallnear Serendah\n\t  CascadesSingle fall\n\t  PicnicSwimming\n\t  A beautiful vertical drop.\nBut ruined by developers....\nLast update April 2010\n\t \n\t  \n\t  Sungei TuaNear Selayang\n\t  RapidsCascadesSingle fall\n\t  PicnicSwimmingCamping\n\t  A couple of nice waterfalls besides the road. Recreation park on the other side of the roadLast update April 2005\n\t \n\t  \n\t  Tekala Fallsnear the Semenyih Dam\n\t  CascadesMultiple falls\n\t  PicnicSwimming\n\t  A popular recreation park in Hulu Langat. Suitable for familiesLast update June 2004\n\t \n\t   Accessability: Moderate\n\t   \n\t   Picture\n\t   Name/Location\n\t   Type\n\t   Activities\n\t   Description\n\t   \n\t  \n\t  Batangsi Fallnear Semenyih\n\t  RapidsCascades\n\t  SwimmingTrekking\n\t  Cascades and rapids in the Sungei Batangsi. Last update April 2010\n\t \n\t  \n\t  Batu Asah FallsAmpang, Near KL\n\t  CascadesMultiple falls\n\t  SwimmingTrekking\n\t  A series of 6 small waterfalls near Zoo NegaraLast update March 2022\n\t \n\t  \n\t  Batu Berayun FallBatang Kali\n\t  CascadesSingle fall\n\t  Trekking\n\t  A long hike and virtually unknown waterfallLast update September 2021\n\t \n\t  \n\t  Batu Bertengkek FallsKerling, Hulu Selangor\n\t  Multiple falls\n\t  Trekking\n\t  A rare contrast of a tall & a wide fall within stone throw reach of each other. Features unique rock boulders.Last update April 2021\n\t \n\t  \n\t  Batu Cherandong Dam FallsKuala Kubu Baru\n\t  RapidsCascadesMultiple falls\n\t  PicnicSwimmingTrekkingCamping\n\t  A pre-independence water catchment dam fall with several smaller natural waterfalls on the same streamLast update April 2022\n\t \n\t  \n\t  Batu Kapal FallsNorth Batu Caves\n\t  CascadesMultiple falls\n\t  Trekking\n\t  A waterfall with an impressively large \"ship\" shaped boulder. Virtually unknown.Last update March 2021\n\t \n\t  \n\t  Bukit Apeh FallUlu Langat FR, access from Cheras\n\t  Multiple falls\n\t  PicnicSwimmingTrekking\n\t  Attractive fall, near to the townLast update January 2009\n\t \n\t  \n\t  Chiling FallsBetween KKB and the Gap\n\t  Multiple falls\n\t  SwimmingTrekkingCamping\n\t  A beautiful fall at the end of an interesting river trekking, during which you have to cross the river several timesLast update August 2015\n\t \n\t  \n\t  Gapi FallAntara Gapi, Hulu Selangor\n\t  Single fall\n\t  Trekking\n\t  Scenic & tall waterfall. Majestic during wet seasons.Last update December 2021\n\t \n\t  \n\t  Gapok FallsKg. Paya Lebar, Hulu Langat\n\t  Multiple falls\n\t  Trekking\n\t  Waterfall series with 11 falls of different presentation. popular during weekends.Last update October 2021\n\t \n\t  \n\t  Jeram PerlusUlu Langat region\n\t  Single fall\n\t  PicnicSwimmingTrekking\n\t  Unspoilt waterfallLast update May 2008\n\t \n\t  \n\t  Kedondong FallAlongside the road between Batang Kali and Gohtong Jaya\n\t  CascadesSingle fall\n\t  PicnicSwimmingTrekking\n\t  Unknown waterfall near popular recreation parkLast update March 2009\n\t \n\t  \n\t  Lata Beringin FallsHulu Langat\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekkingCamping\n\t  Interesting multi-level falls beside a river campsiteLast update April 2022\n\t \n\t  \n\t  Lata MedangNear Kg Pertak\n\t  CascadesMultiple falls\n\t  SwimmingTrekkingCamping\n\t  Remote waterfall. Pristine and unspoiltLast update December 2011\n\t \n\t  \n\t  Lawing FallsNear Kg Sg Lui, Ulu Langat region\n\t  CascadesMultiple falls\n\t  SwimmingTrekking\n\t  Unknown, pristine waterfall in the backyard of KLLast update November 2009\n\t \n\t  \n\t  Lepok Fallin Ulu Langat, near Kg Pangsun\n\t  Single fall\n\t  SwimmingTrekkingCamping\n\t  Lonely,beautiful fall in Ulu Langat. A two hour trek is needed, worth the effortLast update June 2004\n\t \n\t  \n\t  Lolo FallsNear Kg Pangsun\n\t  Multiple falls\n\t  SwimmingTrekking\n\t  Two unspoilt waterfalls, Bomoh Ali and Berembun. You must be able to swim to reach Berembun.Last update May 2013\n\t \n\t  \n\t  Lubuk Kawah FallNear Tanjung Malim\n\t  CascadesMultiple falls\n\t  SwimmingTrekkingCamping\n\t  Pristine fall in Ulu Bernam. Guide neededLast update June 2009\n\t \n\t  \n\t  Masai FallsNear Semenyih\n\t  CascadesMultiple falls\n\t  Trekking\n\t  Unconventional cascade falls series in pristine jungleLast update August 2021\n\t \n\t  \n\t  Pangsun FallKg. Kuala Pangsun, Hulu Langat\n\t  CascadesSingle fall\n\t  Trekking\n\t  Small waterfall upriver of old hydro damLast update November 2019\n\t \n\t  \n\t  Perdik FallUlu Langat region\n\t  Multiple falls\n\t  Trekking\n\t  Small, unknown waterfall in the Ulu Langat regionLast update January 2010\n\t \n\t  \n\t  Pisang FallNear Gombak and the Karak Highway\n\t  Single fall\n\t  SwimmingTrekkingCamping\n\t  Nice small waterfall, reachable from the Karak highway (easy) or after a trek from the old Gombak RoadLast update November 2003\n\t \n\t  \n\t  Setinggi FallBetween Rawang and Serendah\n\t  Multiple falls\n\t  SwimmingTrekking\n\t  Unspoilt waterfallLast update November 2011\n\t \n\t  \n\t  Sg Ampang FallsUlu Klang, near KL\n\t  Multiple falls\n\t  SwimmingTrekking\n\t  Unspoilt waterfalls in scenic surroundings. The first fall also known as Kemansah Fall\nLast update May 2011\n\t \n\t  \n\t  Sg Luit FallsNear Kg Pertak\n\t  CascadesMultiple falls\n\t  SwimmingTrekkingCamping\n\t  Remote, powerful fall. Long access trailLast update February 2012\n\t \n\t  \n\t  Siong FallSemenyih Dam to Negri Sembilan\n\t  Single fall\n\t  Trekking\n\t  The tall cascade can be seen from the main road. An Orang Asli guide is advisable. Pristine conditionsLast update September 2004\n\t \n\t  \n\t  Tarun FallsNear Broga\n\t  Multiple falls\n\t  Trekking\n\t  A majestic falls, can be seasonal during low rainfall.Last update December 2021\n\t \n\t  \n\t  Templer FallsBetween KL and Rawang\n\t  CascadesSingle fall\n\t  PicnicTrekkingCamping\n\t  A nice family site, near to the better known Kanching FallsLast update May 2022\n\t \n\t  \n\t  Ulu Tamu FallsNear Batang Kali\n\t  CascadesMultiple falls\n\t  PicnicSwimmingTrekking\n\t  Unspoilt falls in the backyard of Batang KaliLast update February 2012\n\t \n\n\n\trmb_ki101('79qfmgtj4fu','','26','26',1,'ffffff','010020','00fff6');\nEasyPictureName/LocationTypeActivitiesDescriptionCheh Cascade FallUlu Yam Bahru, Batang KaliCheh Cascade FallUlu Yam Bahru, Batang KaliCascadesPicnicCampingSmall cascade fall near a camping resortLast update March 2022Last update March 2022Last update March 2022Gabai FallsHulu LangatGabai FallsHulu LangatMultiple fallsPicnicSwimmingThis is a popular waterfall, suitable for families, can be crowded during weekendsLast update June 2004Last update June 2004Last update June 2004Jeram Anjang FallHulu LangatJeram Anjang FallHulu LangatSingle fallPicnicCampingPrivate land accessLast update October 2021Last update October 2021Last update October 2021Kanching FallsBetween Selayang and RawangKanching FallsBetween Selayang and RawangCascadesMultiple fallsPicnicSwimmingTrekkingThis recreation park is within easy access from KL. The lower part is easy, suitable for families. The upper falls require trekking. Last update December 2010Last update December 2010Last update December 2010Komanwel FallBetween KL and RawangKomanwel FallBetween KL and RawangSingle fallPicnicTrekkingSmall waterfall in quiet surroundingsLast update September 2009Last update September 2009Last update September 2009Perigi TujuhNorth of Rawang, near SerendahPerigi TujuhNorth of Rawang, near SerendahSingle fallPicnicNot a real waterfall anymore. It has been replaced by seven \"wells\" and a dam. The effect, however is quite picturesqueLast update December 2003Last update December 2003Last update December 2003Sendat Falls5 km from  Ulu Yam BaharuSendat Falls5 km from  Ulu Yam BaharuCascadesMultiple fallsPicnicSwimmingTrekkingCampingStill unspoilt, but for how long?\nLast update April 2005Last update April 2005Last update April 2005Serendah Fallnear SerendahSerendah Fallnear SerendahCascadesSingle fallPicnicSwimmingA beautiful vertical drop.\nBut ruined by developers....\nLast update April 2010Last update April 2010Last update April 2010Sungei TuaNear SelayangSungei TuaNear SelayangRapidsCascadesSingle fallPicnicSwimmingCampingA couple of nice waterfalls besides the road. Recreation park on the other side of the roadLast update April 2005Last update April 2005Last update April 2005Tekala Fallsnear the Semenyih DamTekala Fallsnear the Semenyih DamCascadesMultiple fallsPicnicSwimmingA popular recreation park in Hulu Langat. Suitable for familiesLast update June 2004Last update June 2004Last update June 2004ModeratePictureName/LocationTypeActivitiesDescriptionBatangsi Fallnear SemenyihBatangsi Fallnear SemenyihRapidsCascadesSwimmingTrekkingCascades and rapids in the Sungei Batangsi. Last update April 2010Last update April 2010Last update April 2010Batu Asah FallsAmpang, Near KLBatu Asah FallsAmpang, Near KLCascadesMultiple fallsSwimmingTrekkingA series of 6 small waterfalls near Zoo NegaraLast update March 2022Last update March 2022Last update March 2022Batu Berayun FallBatang KaliBatu Berayun FallBatang KaliCascadesSingle fallTrekkingA long hike and virtually unknown waterfallLast update September 2021Last update September 2021Last update September 2021Batu Bertengkek FallsKerling, Hulu SelangorBatu Bertengkek FallsKerling, Hulu SelangorMultiple fallsTrekkingA rare contrast of a tall & a wide fall within stone throw reach of each other. Features unique rock boulders.Last update April 2021Last update April 2021Last update April 2021Batu Cherandong Dam FallsKuala Kubu BaruBatu Cherandong Dam FallsKuala Kubu BaruRapidsCascadesMultiple fallsPicnicSwimmingTrekkingCampingA pre-independence water catchment dam fall with several smaller natural waterfalls on the same streamLast update April 2022Last update April 2022Last update April 2022Batu Kapal FallsNorth Batu CavesBatu Kapal FallsNorth Batu CavesCascadesMultiple fallsTrekkingA waterfall with an impressively large \"ship\" shaped boulder. Virtually unknown.Last update March 2021Last update March 2021Last update March 2021Bukit Apeh FallUlu Langat FR, access from CherasBukit Apeh FallUlu Langat FR, access from CherasMultiple fallsPicnicSwimmingTrekkingAttractive fall, near to the townLast update January 2009Last update January 2009Last update January 2009Chiling FallsBetween KKB and the GapChiling FallsBetween KKB and the GapMultiple fallsSwimmingTrekkingCampingA beautiful fall at the end of an interesting river trekking, during which you have to cross the river several timesLast update August 2015Last update August 2015Last update August 2015Gapi FallAntara Gapi, Hulu SelangorGapi FallAntara Gapi, Hulu SelangorSingle fallTrekkingScenic & tall waterfall. Majestic during wet seasons.Last update December 2021Last update December 2021Last update December 2021Gapok FallsKg. Paya Lebar, Hulu LangatGapok FallsKg. Paya Lebar, Hulu LangatMultiple fallsTrekkingWaterfall series with 11 falls of different presentation. popular during weekends.Last update October 2021Last update October 2021Last update October 2021Jeram PerlusUlu Langat regionJeram PerlusUlu Langat regionSingle fallPicnicSwimmingTrekkingUnspoilt waterfallLast update May 2008Last update May 2008Last update May 2008Kedondong FallAlongside the road between Batang Kali and Gohtong JayaKedondong FallAlongside the road between Batang Kali and Gohtong JayaCascadesSingle fallPicnicSwimmingTrekkingUnknown waterfall near popular recreation parkLast update March 2009Last update March 2009Last update March 2009Lata Beringin FallsHulu LangatLata Beringin FallsHulu LangatCascadesMultiple fallsPicnicSwimmingTrekkingCampingInteresting multi-level falls beside a river campsiteLast update April 2022Last update April 2022Last update April 2022Lata MedangNear Kg PertakLata MedangNear Kg PertakCascadesMultiple fallsSwimmingTrekkingCampingRemote waterfall. Pristine and unspoiltLast update December 2011Last update December 2011Last update December 2011Lawing FallsNear Kg Sg Lui, Ulu Langat regionLawing FallsNear Kg Sg Lui, Ulu Langat regionCascadesMultiple fallsSwimmingTrekkingUnknown, pristine waterfall in the backyard of KLLast update November 2009Last update November 2009Last update November 2009Lepok Fallin Ulu Langat, near Kg PangsunLepok Fallin Ulu Langat, near Kg PangsunSingle fallSwimmingTrekkingCampingLonely,beautiful fall in Ulu Langat. A two hour trek is needed, worth the effortLast update June 2004Last update June 2004Last update June 2004Lolo FallsNear Kg PangsunLolo FallsNear Kg PangsunMultiple fallsSwimmingTrekkingTwo unspoilt waterfalls, Bomoh Ali and Berembun. You must be able to swim to reach Berembun.Last update May 2013Last update May 2013Last update May 2013Lubuk Kawah FallNear Tanjung MalimLubuk Kawah FallNear Tanjung MalimCascadesMultiple fallsSwimmingTrekkingCampingPristine fall in Ulu Bernam. Guide neededLast update June 2009Last update June 2009Last update June 2009Masai FallsNear SemenyihMasai FallsNear SemenyihCascadesMultiple fallsTrekkingUnconventional cascade falls series in pristine jungleLast update August 2021Last update August 2021Last update August 2021Pangsun FallKg. Kuala Pangsun, Hulu LangatPangsun FallKg. Kuala Pangsun, Hulu LangatCascadesSingle fallTrekkingSmall waterfall upriver of old hydro damLast update November 2019Last update November 2019Last update November 2019Perdik FallUlu Langat regionPerdik FallUlu Langat regionMultiple fallsTrekkingSmall, unknown waterfall in the Ulu Langat regionLast update January 2010Last update January 2010Last update January 2010Pisang FallNear Gombak and the Karak HighwayPisang FallNear Gombak and the Karak HighwaySingle fallSwimmingTrekkingCampingNice small waterfall, reachable from the Karak highway (easy) or after a trek from the old Gombak RoadLast update November 2003Last update November 2003Last update November 2003Setinggi FallBetween Rawang and SerendahSetinggi FallBetween Rawang and SerendahMultiple fallsSwimmingTrekkingUnspoilt waterfallLast update November 2011Last update November 2011Last update November 2011Sg Ampang FallsUlu Klang, near KLSg Ampang FallsUlu Klang, near KLMultiple fallsSwimmingTrekkingUnspoilt waterfalls in scenic surroundings. The first fall also known as Kemansah Fall\nLast update May 2011Last update May 2011Last update May 2011Sg Luit FallsNear Kg PertakSg Luit FallsNear Kg PertakCascadesMultiple fallsSwimmingTrekkingCampingRemote, powerful fall. Long access trailLast update February 2012Last update February 2012Last update February 2012Siong FallSemenyih Dam to Negri SembilanSiong FallSemenyih Dam to Negri SembilanSingle fallTrekkingThe tall cascade can be seen from the main road. An Orang Asli guide is advisable. Pristine conditionsLast update September 2004Last update September 2004Last update September 2004Tarun FallsNear BrogaTarun FallsNear BrogaMultiple fallsTrekkingA majestic falls, can be seasonal during low rainfall.Last update December 2021Last update December 2021Last update December 2021Templer FallsBetween KL and RawangTempler FallsBetween KL and RawangCascadesSingle fallPicnicTrekkingCampingA nice family site, near to the better known Kanching FallsLast update May 2022Last update May 2022Last update May 2022Ulu Tamu FallsNear Batang KaliUlu Tamu FallsNear Batang KaliCascadesMultiple fallsPicnicSwimmingTrekkingUnspoilt falls in the backyard of Batang KaliLast update February 2012Last update February 2012Last update February 2012"
    ],
    "img": "/images/states/flag12.gif"
  },
  {
    "url": "200Cheh.php",
    "textArr": [
      "Cheh Cascade FallUlu Yam Bahru, Batang KaliCheh Cascade FallUlu Yam Bahru, Batang KaliCascadesPicnicCampingSmall cascade fall near a camping resortLast update March 2022Last update March 2022Last update March 2022"
    ],
    "img": "/images/database/img_20211204_123015_637.jpg"
  },
  {
    "url": "06gabai.php",
    "textArr": [
      "Gabai FallsHulu LangatGabai FallsHulu LangatMultiple fallsPicnicSwimmingThis is a popular waterfall, suitable for families, can be crowded during weekendsLast update June 2004Last update June 2004Last update June 2004"
    ],
    "img": "/images/database/06gabai.jpg"
  },
  {
    "url": "191JAnjang.php",
    "textArr": [
      "Jeram Anjang FallHulu LangatJeram Anjang FallHulu LangatSingle fallPicnicCampingPrivate land accessLast update October 2021Last update October 2021Last update October 2021"
    ],
    "img": "/images/database/20220419_1200052655561745037290163_large.jpg"
  },
  {
    "url": "01kanching.php",
    "textArr": [
      "Kanching FallsBetween Selayang and RawangKanching FallsBetween Selayang and RawangCascadesMultiple fallsPicnicSwimmingTrekkingThis recreation park is within easy access from KL. The lower part is easy, suitable for families. The upper falls require trekking. Last update December 2010Last update December 2010Last update December 2010"
    ],
    "img": "/images/database/waterfnost-010.jpg"
  },
  {
    "url": "134komanwel.php",
    "textArr": [
      "Komanwel FallBetween KL and RawangKomanwel FallBetween KL and RawangSingle fallPicnicTrekkingSmall waterfall in quiet surroundingsLast update September 2009Last update September 2009Last update September 2009"
    ],
    "img": "/images/database/DSC_0207.JPG"
  },
  {
    "url": "03perigitujoh.php",
    "textArr": [
      "Perigi TujuhNorth of Rawang, near SerendahPerigi TujuhNorth of Rawang, near SerendahSingle fallPicnicNot a real waterfall anymore. It has been replaced by seven \"wells\" and a dam. The effect, however is quite picturesqueLast update December 2003Last update December 2003Last update December 2003"
    ],
    "img": "/images/database/03perigitujoh.jpg"
  },
  {
    "url": "04sendat.php",
    "textArr": [
      "Sendat Falls5 km from  Ulu Yam BaharuSendat Falls5 km from  Ulu Yam BaharuCascadesMultiple fallsPicnicSwimmingTrekkingCampingStill unspoilt, but for how long?\nLast update April 2005Last update April 2005Last update April 2005"
    ],
    "img": "/images/database/sendat04.JPG"
  },
  {
    "url": "52serendah.php",
    "textArr": [
      "Serendah Fallnear SerendahSerendah Fallnear SerendahCascadesSingle fallPicnicSwimmingA beautiful vertical drop.\nBut ruined by developers....\nLast update April 2010Last update April 2010Last update April 2010"
    ],
    "img": "/images/database/serendah05.jpg"
  },
  {
    "url": "53sungeitua.php",
    "textArr": [
      "Sungei TuaNear SelayangSungei TuaNear SelayangRapidsCascadesSingle fallPicnicSwimmingCampingA couple of nice waterfalls besides the road. Recreation park on the other side of the roadLast update April 2005Last update April 2005Last update April 2005"
    ],
    "img": "/images/database/sungeitua09.JPG"
  },
  {
    "url": "07tekala.php",
    "textArr": [
      "Tekala Fallsnear the Semenyih DamTekala Fallsnear the Semenyih DamCascadesMultiple fallsPicnicSwimmingA popular recreation park in Hulu Langat. Suitable for familiesLast update June 2004Last update June 2004Last update June 2004"
    ],
    "img": "/images/database/07tekala.jpg"
  },
  {
    "url": "86batangsi.php",
    "textArr": [
      "Batangsi Fallnear SemenyihBatangsi Fallnear SemenyihRapidsCascadesSwimmingTrekkingCascades and rapids in the Sungei Batangsi. Last update April 2010Last update April 2010Last update April 2010"
    ],
    "img": "/images/database/serendah05.jpg"
  },
  {
    "url": "177BatuAsah.php",
    "textArr": [
      "Batu Asah FallsAmpang, Near KLBatu Asah FallsAmpang, Near KLCascadesMultiple fallsSwimmingTrekkingA series of 6 small waterfalls near Zoo NegaraLast update March 2022Last update March 2022Last update March 2022"
    ],
    "img": "/images/database/atbatuasah1web.png"
  },
  {
    "url": "192BBerayun.php",
    "textArr": [
      "Batu Berayun FallBatang KaliBatu Berayun FallBatang KaliCascadesSingle fallTrekkingA long hike and virtually unknown waterfallLast update September 2021Last update September 2021Last update September 2021"
    ],
    "img": "/images/database/f346524978web.jpg"
  },
  {
    "url": "174BatuBertengkek.php",
    "textArr": [
      "Batu Bertengkek FallsKerling, Hulu SelangorBatu Bertengkek FallsKerling, Hulu SelangorMultiple fallsTrekkingA rare contrast of a tall & a wide fall within stone throw reach of each other. Features unique rock boulders.Last update April 2021Last update April 2021Last update April 2021"
    ],
    "img": "/images/database/groundlevelupperbatubertengkekfinalresizedweb.jpg"
  },
  {
    "url": "187BtCherandong.php",
    "textArr": [
      "Batu Cherandong Dam FallsKuala Kubu BaruBatu Cherandong Dam FallsKuala Kubu BaruRapidsCascadesMultiple fallsPicnicSwimmingTrekkingCampingA pre-independence water catchment dam fall with several smaller natural waterfalls on the same streamLast update April 2022Last update April 2022Last update April 2022"
    ],
    "img": "/images/database/batucherandongdamscene2web.jpg"
  },
  {
    "url": "193BKapal.php",
    "textArr": [
      "Batu Kapal FallsNorth Batu CavesBatu Kapal FallsNorth Batu CavesCascadesMultiple fallsTrekkingA waterfall with an impressively large \"ship\" shaped boulder. Virtually unknown.Last update March 2021Last update March 2021Last update March 2021"
    ],
    "img": "/images/database/51219398133_0c693b38d3_oweb.jpg"
  },
  {
    "url": "114bukitapeh.php",
    "textArr": [
      "Bukit Apeh FallUlu Langat FR, access from CherasBukit Apeh FallUlu Langat FR, access from CherasMultiple fallsPicnicSwimmingTrekkingAttractive fall, near to the townLast update January 2009Last update January 2009Last update January 2009"
    ],
    "img": "/images/database/IMG_4372.jpg"
  },
  {
    "url": "51chiling.php",
    "textArr": [
      "Chiling FallsBetween KKB and the GapChiling FallsBetween KKB and the GapMultiple fallsSwimmingTrekkingCampingA beautiful fall at the end of an interesting river trekking, during which you have to cross the river several timesLast update August 2015Last update August 2015Last update August 2015"
    ],
    "img": "/images/database/51chiling.jpg"
  },
  {
    "url": "173gapi.php",
    "textArr": [
      "Gapi FallAntara Gapi, Hulu SelangorGapi FallAntara Gapi, Hulu SelangorSingle fallTrekkingScenic & tall waterfall. Majestic during wet seasons.Last update December 2021Last update December 2021Last update December 2021"
    ],
    "img": "/images/database/airterjungapiportraitfinalresizedweb.jpg"
  },
  {
    "url": "172gapok.php",
    "textArr": [
      "Gapok FallsKg. Paya Lebar, Hulu LangatGapok FallsKg. Paya Lebar, Hulu LangatMultiple fallsTrekkingWaterfall series with 11 falls of different presentation. popular during weekends.Last update October 2021Last update October 2021Last update October 2021"
    ],
    "img": "/images/database/sekiaufallsfinallayer.jpg"
  },
  {
    "url": "120jeramperlus.php",
    "textArr": [
      "Jeram PerlusUlu Langat regionJeram PerlusUlu Langat regionSingle fallPicnicSwimmingTrekkingUnspoilt waterfallLast update May 2008Last update May 2008Last update May 2008"
    ],
    "img": "/images/database/11._Falls___pool_best.JPG"
  },
  {
    "url": "124kedongdong.php",
    "textArr": [
      "Kedondong FallAlongside the road between Batang Kali and Gohtong JayaKedondong FallAlongside the road between Batang Kali and Gohtong JayaCascadesSingle fallPicnicSwimmingTrekkingUnknown waterfall near popular recreation parkLast update March 2009Last update March 2009Last update March 2009"
    ],
    "img": "/images/database/P3080014.JPG"
  },
  {
    "url": "189LBeringinSemungkis.php",
    "textArr": [
      "Lata Beringin FallsHulu LangatLata Beringin FallsHulu LangatCascadesMultiple fallsPicnicSwimmingTrekkingCampingInteresting multi-level falls beside a river campsiteLast update April 2022Last update April 2022Last update April 2022"
    ],
    "img": "/images/database/lataberinginfall1finalresizedweb.jpg"
  },
  {
    "url": "150medang.php",
    "textArr": [
      "Lata MedangNear Kg PertakLata MedangNear Kg PertakCascadesMultiple fallsSwimmingTrekkingCampingRemote waterfall. Pristine and unspoiltLast update December 2011Last update December 2011Last update December 2011"
    ],
    "img": "/images/database/IMG_1594.JPG"
  },
  {
    "url": "133lawing.php",
    "textArr": [
      "Lawing FallsNear Kg Sg Lui, Ulu Langat regionLawing FallsNear Kg Sg Lui, Ulu Langat regionCascadesMultiple fallsSwimmingTrekkingUnknown, pristine waterfall in the backyard of KLLast update November 2009Last update November 2009Last update November 2009"
    ],
    "img": "/images/database/DSC_0028.JPG"
  },
  {
    "url": "83lepok.php",
    "textArr": [
      "Lepok Fallin Ulu Langat, near Kg PangsunLepok Fallin Ulu Langat, near Kg PangsunSingle fallSwimmingTrekkingCampingLonely,beautiful fall in Ulu Langat. A two hour trek is needed, worth the effortLast update June 2004Last update June 2004Last update June 2004"
    ],
    "img": "/images/database/83lepok.jpg"
  },
  {
    "url": "84lolo.php",
    "textArr": [
      "Lolo FallsNear Kg PangsunLolo FallsNear Kg PangsunMultiple fallsSwimmingTrekkingTwo unspoilt waterfalls, Bomoh Ali and Berembun. You must be able to swim to reach Berembun.Last update May 2013Last update May 2013Last update May 2013"
    ],
    "img": "/images/database/IMG_5843.JPG"
  },
  {
    "url": "20lubukkawah.php",
    "textArr": [
      "Lubuk Kawah FallNear Tanjung MalimLubuk Kawah FallNear Tanjung MalimCascadesMultiple fallsSwimmingTrekkingCampingPristine fall in Ulu Bernam. Guide neededLast update June 2009Last update June 2009Last update June 2009"
    ],
    "img": "/images/database/P2070047.JPG"
  },
  {
    "url": "182Masai.php",
    "textArr": [
      "Masai FallsNear SemenyihMasai FallsNear SemenyihCascadesMultiple fallsTrekkingUnconventional cascade falls series in pristine jungleLast update August 2021Last update August 2021Last update August 2021"
    ],
    "img": "/images/database/lowerlatamasaifallsaltrfinalweb.jpg"
  },
  {
    "url": "175Pangsun.php",
    "textArr": [
      "Pangsun FallKg. Kuala Pangsun, Hulu LangatPangsun FallKg. Kuala Pangsun, Hulu LangatCascadesSingle fallTrekkingSmall waterfall upriver of old hydro damLast update November 2019Last update November 2019Last update November 2019"
    ],
    "img": "/images/database/jerampangsunfalls2web.png"
  },
  {
    "url": "44perdik.php",
    "textArr": [
      "Perdik FallUlu Langat regionPerdik FallUlu Langat regionMultiple fallsTrekkingSmall, unknown waterfall in the Ulu Langat regionLast update January 2010Last update January 2010Last update January 2010"
    ],
    "img": "/images/database/IMG_8521.JPG"
  },
  {
    "url": "50pisang.php",
    "textArr": [
      "Pisang FallNear Gombak and the Karak HighwayPisang FallNear Gombak and the Karak HighwaySingle fallSwimmingTrekkingCampingNice small waterfall, reachable from the Karak highway (easy) or after a trek from the old Gombak RoadLast update November 2003Last update November 2003Last update November 2003"
    ],
    "img": "/images/database/50pisang.jpg"
  },
  {
    "url": "149setinggi.php",
    "textArr": [
      "Setinggi FallBetween Rawang and SerendahSetinggi FallBetween Rawang and SerendahMultiple fallsSwimmingTrekkingUnspoilt waterfallLast update November 2011Last update November 2011Last update November 2011"
    ],
    "img": "/images/database/DSC_6696.jpg"
  },
  {
    "url": "77ampang.php",
    "textArr": [
      "Sg Ampang FallsUlu Klang, near KLSg Ampang FallsUlu Klang, near KLMultiple fallsSwimmingTrekkingUnspoilt waterfalls in scenic surroundings. The first fall also known as Kemansah Fall\nLast update May 2011Last update May 2011Last update May 2011"
    ],
    "img": "/images/database/ampang11.JPG"
  },
  {
    "url": "152luit.php",
    "textArr": [
      "Sg Luit FallsNear Kg PertakSg Luit FallsNear Kg PertakCascadesMultiple fallsSwimmingTrekkingCampingRemote, powerful fall. Long access trailLast update February 2012Last update February 2012Last update February 2012"
    ],
    "img": "/images/database/IMG_2221.JPG"
  },
  {
    "url": "43siong.php",
    "textArr": [
      "Siong FallSemenyih Dam to Negri SembilanSiong FallSemenyih Dam to Negri SembilanSingle fallTrekkingThe tall cascade can be seen from the main road. An Orang Asli guide is advisable. Pristine conditionsLast update September 2004Last update September 2004Last update September 2004"
    ],
    "img": "/images/database/siong07.JPG"
  },
  {
    "url": "181Tarun.php",
    "textArr": [
      "Tarun FallsNear BrogaTarun FallsNear BrogaMultiple fallsTrekkingA majestic falls, can be seasonal during low rainfall.Last update December 2021Last update December 2021Last update December 2021"
    ],
    "img": "/images/database/tarunfallportraitfinalresizedweb.jpg"
  },
  {
    "url": "02templar.php",
    "textArr": [
      "Templer FallsBetween KL and RawangTempler FallsBetween KL and RawangCascadesSingle fallPicnicTrekkingCampingA nice family site, near to the better known Kanching FallsLast update May 2022Last update May 2022Last update May 2022"
    ],
    "img": "/images/database/file4783web.jpg"
  },
  {
    "url": "157ulutamu.php",
    "textArr": [
      "Ulu Tamu FallsNear Batang KaliUlu Tamu FallsNear Batang KaliCascadesMultiple fallsPicnicSwimmingTrekkingUnspoilt falls in the backyard of Batang KaliLast update February 2012Last update February 2012Last update February 2012"
    ],
    "img": "/images/database/IMG_0726.JPG"
  }
]
