{"name":"Batangsi Fall","description":"Mysterious  Following this small road for about six km, we arrived at a crayfish farm. Here the road ended at a rickety bridge.The caretaker of the farm was clear, yes, the Batangsi fall was near, you just had to follow the river. Was it a big fall? No, just a small one.Following the riverIs this Batangsi ?27-4-2005 Batangsi mystery solved!The 'real' Batangsi, but actually not more than some rapidsCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Selangor","location":{"verbatimCoordinates":"N03 01.82' E101 54.26'","verbatimLatitude":"N03 01.82'","verbatimLongitude":"E101 54.26'","decimalLatitude":3.03033,"decimalLongitude":101.90433,"decimalCoordinates":"3.03033,101.90433"},"coordinates":"N03 01.82'  E101 54.26'","waterSource":"Small River","waterfallProfile":"Cascades, Rapids","accessibility":"River trekking","imgDetails":{"imgFilename":["TNbatangsi01.JPG","TNbatangsi02.JPG","TNbatangsi03.JPG","TNbatangsi04.JPG","TNbatangsi05.JPG","TNbatangsi06.JPG","TNbatangsi07.JPG","TNbatangsi08.JPG","TNbatangsi09-001.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi01.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi02.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi03.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi04.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi05.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi06.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi07.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi08.JPG","http://waterfallsofmalaysia.com/images/86batangsi/tn/TNbatangsi09-001.jpg"],"imgDesc":["The Batangsi Falls are shrouded in mystery. At the Batu 18 junction of the road from Ulu Langat to Kg Pangsun there is a signboard indictating three waterfalls in Ulu Langat: Gabai, Tekala and BatangsiThe Gabai and Tekala falls are signposted and easy to find.But for Batangsi there is no further clue.On the map there is a Sungei Batangsi and asking around for directions at that location, there was no mistake, yes there was a Lata Batangsi and a small road was pointed at.So we tried our luck","Gabai, Tekala","Batangsi","\n\t","Following this small road for about six km, we arrived at a crayfish farm. Here the road ended at a  rickety bridge.The caretaker of the farm was clear, yes, the Batangsi fall was near, you just had to follow the river. Was it a big fall? No, just a small one.","Arriving at the river, some local fisherman confirmed that there was a waterfall upstream.So we just followed the river bed, which was easy as the river had a sandy bottom and the stream was not strong."," After progressing for about 1 km, we could definitely hear the sound of rushing water... ","And, indeed, we arrived at a three-tier waterfall, although, honestly, it could almost be called rapids.A nice place to have a jacuzzi-like bath!"," The question remains, is this Batangsi? If it is, then it can hardly be compared with Gabai or even Tekala.Or is there another, bigger waterfall, further upstream? Any information is welcome, just mail us","27-4-2005  Batangsi mystery solved!","During a next trip to Batangsi the mystery was finally solved. Our plan was to see if there was a waterfall further upstream. But the guards at the fish farm said that there was nothing. However, on our way back to the mainroad, we saw a small road leading to the river with remains of some shelters. And the river had some nice cascades there. So it is clear now that this is the location of the Batangsi \"falls\"","\n\t","The entrance too the fish farm is now closed, but you can ask permission to continue to the rapids","One of the shelters. In earlier days this must have been a recreation area"],"imgFullResFilename":["batangsi02.JPG","batangsi03.JPG","batangsi04.JPG","batangsi08.JPG","batangsi06.JPG","batangsi05.JPG","batangsi00.gif","batangsi09-001.jpg","batangsi01.JPG","batangsi07.JPG"]},"url":"86batangsi.php"}