{"name":"Batu Kapal Falls","description":"s is a horsetail fall with an impressively large ship bow shaped boulder as the centerpiece. Its position hangs in the air by a delicate balance, overshadowing the falls in terms of height. The boulder also splits the pool into half and forms a decently sized cave on the left section. A guide is recommended to visit this waterfall as there is no clear trail from the river.Batu Kapal FallHead to Sg Tua waterfall as the landmark. There is a water spring nearby where townfolk may stop to collect water.() Visitors can park around this area as there is no parking near the trail head.()The trail is clear at 1st and leads to a river side clearing of main Sg. Batu. This is however NOT the river where the waterfall is located. It is the eastern river. The trail is not clear and there will be both jungle trekking and river trekking. Along the way there will be some interesting cascades and a small waterfall.()There is a rocky continuous cascade fall on the right tributary upriver. There may be more falls as well on the left tributary upriver.Image 1Image 2Image 3\"Rubbish exist when there is an imbalance of those willing to take action.\"If you plan to visit this waterfall, do bring a plastic bag along. In the event there is rubbish left by irresponsible individuals, you can contribute and do our part to keep nature's paradise clean.Thank you~ ","state":"Selangor","location":{"verbatimCoordinates":"3.34716, 101.71999","verbatimLatitude":"3.34716","verbatimLongitude":"101.71999","decimalLatitude":3.34716,"decimalLongitude":101.71999,"decimalCoordinates":"3.34716,101.71999"},"coordinates":"3.34716, 101.71999","waterSource":"Anak Sg. Batu, Natural Stream","waterfallProfile":"Horsetail Fall, with Pool","accessibility":"Trekking, ~ 2 Hours","imgDetails":{"imgFilename":["TN51219398133_0c693b38d3_oweb.jpg","TNscreenshot(739).png","TNscreenshot(740).png","TNscreenshot(741).png"],"imgUrl":["http://waterfallsofmalaysia.com/images/193BKapal/tn/TN51219398133_0c693b38d3_oweb.jpg","http://waterfallsofmalaysia.com/images/193BKapal/tn/TNscreenshot(739).png","http://waterfallsofmalaysia.com/images/193BKapal/tn/TNscreenshot(740).png","http://waterfallsofmalaysia.com/images/193BKapal/tn/TNscreenshot(741).png"],"imgDesc":["Batu Kapal Fall","Image 1","Image 2","Image 3"],"imgFullResFilename":["screenshot(738).png","screenshot(739).png","51219398133_0c693b38d3_oweb.jpg","screenshot(741).png","screenshot(740).png"]},"url":"193BKapal.php"}