{"name":"Batu Cherandong","description":" Falls is a series of 4 waterfalls with the pre-independence water catchment dam being the main featured fall. It is quite a tall structure with 9-steps stairs drop that results in a picturesque scene. There is a small pool at the base of the dam with a number of piping support pillars. There are 2 more falls situated downriver while the last fall (Lata Kancil) is situated another 300m upriver. Forestry permit is required to visit Lata Kancil.Batu Cherandong DamHead to Kuala Kubu Baru as the landmark. From the north, visitors will pass the KKB town and the Fire & Rescue Station on the left. From the south, there is a junction on the right near Rasa town that will take you directly to the Sg. Selangor bridge.(ref Image 1) There is a blue hanging bridge at the road junction to the trail.Proceed straight on the tarred road all the way till you reach a forked Y-junction. There is 2 paths on the left going into the palm oil estate.(ref Image 2) Take the left path. The road condition inside is narrow & not tarred thou quite flat and possible to pass by normal sedan cars. At the end of the path there is a junction down to the left that will take you to Buluh Telor campsite.(ref )Image 3Parking space can be limited if there is a large crowd. There are more parking spaces inside following the dirt trail. Ensure to park without obstructing the road! The trail to the waterfall is a short and easy one starting from Faruq campsite(signposted!) under local orang asli care. There will be an entry fee of RM2 to visit the Batu Cherandong Dam. An additional forestry permit is required to visit the upper Lata Kancil falls. From here on visitors may take either the river side trail or the high pass jungle trail. There is a clearly signposted junction to indicate Batu Cherandong Dam junction if you take the high pass.(ref Image 4)Visitors who wish to visit the lower falls can scramble down the trail after passing the river crossing. Lata Four is the 1st waterfall that flows directly into Sg. Selangor.Above the dam area is a shallow sandy riverbed. There is a messy looking cascade close by. Lata Kancil is another ~25min upriver. There is only a shallow pool here. Quite a tall fall with 3 tier drop.\"Rubbish exist when there is an imbalance of those willing to take action.\"If you plan to visit this waterfall, do bring a plastic bag along. In the event there is rubbish left by irresponsible individuals, you can contribute and do our part to keep nature's paradise clean.Thank you~ ","state":"Selangor","location":{"verbatimCoordinates":"3.55531, 101.69049","verbatimLatitude":"3.55531","verbatimLongitude":"101.69049","decimalLatitude":3.55531,"decimalLongitude":101.69049,"decimalCoordinates":"3.55531,101.69049"},"coordinates":"3.55531, 101.69049 - 3.55342, 101.69353","waterSource":"Sg. ???, Natural Stream","waterfallProfile":"Multi-Level Falls, 1 Man-made","accessibility":"Trekking, <1 hour","imgDetails":{"imgFilename":["TNbatucherandongdamweb.jpg","TNscreenshot(675).png","TNimg_20220424_130431_343.jpg","TN20220424_0840511488116208738811994_large.jpg","TN20220424_0859163254472808819431810_large.jpg","TNlatafourweb.jpg","TNdsc07610-dsc07611web.jpg","TNbtchrndngcascadeweb.jpg","TNlatakancilfallweb.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNbatucherandongdamweb.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNscreenshot(675).png","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNimg_20220424_130431_343.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TN20220424_0840511488116208738811994_large.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TN20220424_0859163254472808819431810_large.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNlatafourweb.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNdsc07610-dsc07611web.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNbtchrndngcascadeweb.jpg","http://waterfallsofmalaysia.com/images/187BtCherandong/tn/TNlatakancilfallweb.jpg"],"imgDesc":["Batu Cherandong Dam","Image 1.","Image 2.","Image 3","Image 4.","Lata Four fall","Fall 2","Cascades","Lata Kancil Fall"],"imgFullResFilename":["20220424_0840511488116208738811994_large.jpg","batucherandongdamweb.jpg","latafourweb.jpg","20220424_0859163254472808819431810_large.jpg","screenshot(675).png","img_20220424_130431_343.jpg","screenshot(671).jpg","btchrndngcascadeweb.jpg","dsc07610-dsc07611web.jpg","latakancilfallweb.jpg"]},"url":"187BtCherandong.php"}