{"name":"Gapoi Fall","description":"Along the road from Karak to Simpang Pertang there are several attractive waterfalls. One of them is the Gapoi Fall. The eastern slope of the Main Range is particularly wet, so these are perennial falls.To reach the fall follow the road from Karak to Kuala Pilah until after Gapoi. Just after a water filtration plant, a small road leads to an Orang Asli village.In the rainy season the Gapoi river carries a lot of water and it may be problematic to cross it. But when we visited the fall, the crossing was easy. After crossing the river, a trail leads through sometimes thick undergrowth to the fall. Not more than 300 meters.The waterfall is enclosed at both sides by steep rocky slopes. A nice pool invites for a swim.On our way back to civilisation.Archived page availableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Pahang","location":{"verbatimCoordinates":"N03 15.39' E102 06.18'","verbatimLatitude":"N03 15.39'","verbatimLongitude":"E102 06.18'","decimalLatitude":3.2565,"decimalLongitude":102.103,"decimalCoordinates":"3.2565,102.103"},"coordinates":"N03 15.39'     E102 06.18'","waterSource":"River","waterfallProfile":"Vertical Fall","accessibility":"Trekking","imgDetails":{"imgFilename":["TNgapoi01.JPG","TNgapoi02.JPG","TNgapoi03.JPG","TNgapoi04.JPG","TNgapoi05.JPG","TNgapoi06.JPG","TNgapoi07.JPG","TNgapoi08.JPG","TNgapoi09.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi01.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi02.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi03.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi04.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi05.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi06.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi07.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi08.JPG","http://waterfallsofmalaysia.com/images/39gapoi/tn/TNgapoi09.JPG"],"imgDesc":["The fall itself is not signposted. Look for this signboard.","After a while the road becomes a good quality dirt road.","Where the road comes near the river, you can park the car and cross the river.","The trail looks heavily overgrown, but is actually easy to follow.","After a few hundred meters the trail bends back to the river and the fall becomes visible (and audible!)","Even in the dry season the fall is quite powerful and impressive","The power of the waterfall results in a mist of water at the bottom.","The rocky slopes are impossible to climb. It might be possible to scramble to the top of the fall through the forested slopes at the left"],"imgFullResFilename":["gapoi00.gif","gapoi01.JPG","gapoi07.JPG","gapoi04.JPG","gapoi03.JPG","gapoi06.JPG","gapoi08.JPG","gapoi09.JPG","gapoi02.JPG","gapoi05.JPG"]},"url":"39gapoi.php"}