{"name":"Kamunting Fall","description":"Besides the Maxwell Hill fall, visible from the Lake Gardens in Taiping, there is another conspicuous waterfall, visible from nearby Kamunting. But how to reach this fall?With the help of local people we found the trail. It starts actually from the trail to the Maxwell Hill fall. So you start at the gate of the water treatment plant and follow the track just outside the fence. After a few hundred meters the fence turns sharply to the left. Here the trail splits. To the right, starting with some steps, it leads to the Maxwell fall. For the Kamunting fall you turn left and keep following the fence. Where the fence ends a nice trail continues following a water pipe.Follow this pipe for about 45 minutes. You will pass an attractive small waterfall. The pipe ends at a small reservoir. About one hundred meter before this reservoir, a vague trail, indicated by yellow markers, starts to the right. This is a steep climb up, scrambling required, but here and there ropes will help you. After the initial steep part, the trail levels a bit and you will start hearing the sound of falling water. Soon you will reach the fall.It is a tall rock face. Not a lot of water during our visit, but that will be different after heavy rain. No real pool, but there are places to take a bath. Maybe it is possible to climb to the top of the fall, keeping the right side, but it will not be easy, parang needed.The lower part. Not a real poolThe fall is in pristine condition, keep it that way!Check if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Perak","location":{"verbatimCoordinates":"N 04 52.71' E 100 46.28'","verbatimLatitude":"N 04 52.71'","verbatimLongitude":"E 100 46.28'","decimalLatitude":4.8785,"decimalLongitude":100.77133,"decimalCoordinates":"4.8785,100.77133"},"coordinates":"N 04 52.71'  E 100 46.28'","waterSource":"Stream","waterfallProfile":"Near Vertical Fall","accessibility":"Trekking","imgDetails":{"imgFilename":["TNP1190063.JPG","TNP1190032.JPG","TNP1190060.JPG","TNP1190036.JPG","TNP1190037.JPG","TNP1190038.JPG","TNP1190046.JPG","TNP1190050.JPG","TNP1190052.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190063.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190032.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190060.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190036.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190037.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190038.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190046.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190050.JPG","http://waterfallsofmalaysia.com/images/37kamunting/tn/TNP1190052.JPG"],"imgDesc":["The Kamunting fall, as seen from Taman Bukit Emas in Kamunting","Just follow the trail outside the fence","Then follow the water pipe through nice bamboo forest","An attractive small waterfall along the trail","Near the reservoir. Time for a leech check","Start of the strenuous scramble","The Kamunting fall. Imposing rock face.","The top part of the fall"],"imgFullResFilename":["P1190060.JPG","kamunting00.jpg","P1190052.JPG","P1190037.JPG","P1190032.JPG","P1190046.JPG","P1190050.JPG","P1190036.JPG","P1190063.JPG","P1190038.JPG"]},"url":"37kamunting.php"}