{"name":"Kanching Falls","description":"Seven waterfalls...!!The Kapor FallThe call of advenure...That there are no more waterfalls upsream, is not true. When you continue river trekking for about one hour after the top fall, you will reach two more nice waterfalls!And a few smaller fallsArchived Page AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Selangor","location":{"verbatimCoordinates":"N 03° 18.13' E101° 37.19'","verbatimLatitude":"N 03°","verbatimLongitude":"18.13' E101° 37.19'","decimalLatitude":3.30217,"decimalLongitude":101.61983,"decimalCoordinates":"3.30217,101.61983"},"coordinates":"N 03° 18.13' E101° 37.19'","waterSource":"Stream","waterfallProfile":"7 Falls, most vertical ones","accessibility":"Public Transport, Trekking","imgDetails":{"imgFilename":["TNkanching01.JPG","TNkanching02.JPG","TNkanching03.JPG","TNkanching04.JPG","TNkanching05.JPG","TNkanching06.JPG","TNkanching07.JPG","TNkanching08.JPG","TNkanching09.JPG","TNkanching10.JPG","TNkanching11.JPG","TNP2180030.JPG","TNP2180035.JPG","TNP2180039.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching01.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching02.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching03.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching04.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching05.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching06.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching07.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching08.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching09.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching10.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNkanching11.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNP2180030.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNP2180035.JPG","http://waterfallsofmalaysia.com/images/01kanching/tn/TNP2180039.JPG"],"imgDesc":["Pleasure park of Kuala Lumpur"," It may come as a surprise for some, but quite near to the bustling metropolis of Kuala Lumpur, there are many beautyful nature spots."," WARNING!! Beware of thieves, especially at the upper tiers. They follow you, hiding in the jungle, and grab your stuff when you are taking a bath.","WARNING!! Beware of thieves, especially at the upper tiers. They follow you, hiding in the jungle, and grab your stuff when you are taking a bath.","\n\t","One of them is the Hutan Lipur Kanching. This well maintained recreation park is located off the trunk road nr 1 to Ipoh, between Selayang and Rawang.Bus nr 43 will bring you there from Central Market in less than one hour.The first part is perfectly suited for family trips and can be crowded during weekends.There are many nice picknick spots along the small stream which is meandering quietly between meadows and does not indicate that there are waterfalls nearby. Just follow the cemented path...!","Where does one waterfall end and the next one start? This can be a bit confusing here, because there are many falls, covering a total height difference of about 200 meters. The first fall is a romantic and secluded one.But not very suitable for bathing. Near the second fall an attempt has been made to construct a kind of swimming pool.","The next fall, the Kapor Fall, could be appropriately called THE Kanching Fall. There are dressing rooms here, toilets and shelters. Take care when you leave your belongings here and go for a relaxing swim, because there are many curious monkeys around!","At the top there is waterfall nr 4 (picture to the left)and here is the end of the concrete steps. But there is more to see, although it will require more effort and some scrambling. ","You have to climb up steep slopes, there are trails on both sides of the stream, the left trail is easier but not as interesting as the one on the right side. The next fall has no swimming pool, but a perfect shower!","The next fall is a big one. Can you still call this a fall or is it just the stream going down steeply for about 60 meters? Take care, this place is not suitable for swimming anymore, although some trees manage to survive in these adverse conditions.","At the top of waterfall nr 6, the landscape changes suddenly. Climbing out of the valley, for the first time you have a clear view of the opposite site, far away. There is one last waterfall, a jewel, watch the colours of the rocks here! Rest, enjoy and relax. If you keep going on(no trail, just follow the river bed) you will find no more falls, but quiet, pristine jungle. Where does it end? Try to find out for yourself!","Update February 2009","Upper Kanching fall nr 1","Upper Kanching fall nr 2"],"imgFullResFilename":["P2180039.JPG","kanching04.JPG","kanching03.JPG","kanching08.JPG","kanching00.gif","kanching02.JPG","kanching10.JPG","kanching05.JPG","kanching09.JPG","P2180035.JPG","kanching11.JPG","P2180030.JPG","kanching07.JPG","kanching01.JPG","kanching06.JPG"]},"url":"01kanching.php"}