{"name":"Lata Khong","description":"The Sungei Dua is a small river coming from the main range. A biking trail of about 20 km is supposed to lead to a waterfall. A real expedition. But the river has other falls, nearer to the mainroad and relatively unknown. To find the access road is complicated, see link above for detailsWhen we asked the locals about the name of the fall, they only could tell us the name of the river. We decided to name the fall Lata Khong in honour of the founder of this website.This is a nice waterfal in beautiful surroundings, within easy reach of Kuala LumpurRecently we revisited the site and found more tiers, upstream of Lata Khong. Also the road is now tarred until the falls and in good condition. To reach the upper tiers, you don't take the steep road down, but continue for about 50-100 meters. You can park you car here. A trail goes very steeply down to the upper Sg Dua fall.Just before you you erach this fall, another vague trail splits off to the left. It is even steeper and after rain you better not try the slippery rocks. These middle falls consist themselves of several tiers. Daredevils can scramble down and reach the top of Lata Khong!Between the middle Sg Dua fall and Lata KhongCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Pahang","location":{"verbatimCoordinates":"N03° 26.04' E101° 59.17'","verbatimLatitude":"N03° 26.04'","verbatimLongitude":"E101° 59.17'","decimalLatitude":3.434,"decimalLongitude":101.98617,"decimalCoordinates":"3.434,101.98617"},"coordinates":"N03° 26.04'  E101° 59.17'  ","waterSource":"River","waterfallProfile":"Vertical Falls","accessibility":"4WD advisable","imgDetails":{"imgFilename":["TNkhong01.JPG","TNkhong02.JPG","TNkhong03.JPG","TNkhong04.JPG","TNkhong05.JPG","TNkhong06.JPG","TNkhong07.JPG","TNkhong08.JPG","TNkhong09.JPG","TNP1260063.JPG","TNsg_dua_.jpg","TNlata_karl-1.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong01.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong02.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong03.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong04.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong05.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong06.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong07.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong08.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNkhong09.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNP1260063.JPG","http://waterfallsofmalaysia.com/images/91khong/tn/TNsg_dua_.jpg","http://waterfallsofmalaysia.com/images/91khong/tn/TNlata_karl-1.jpg"],"imgDesc":["The trail head is a bit complicated to find, as it is an unmarked exit of the Karak highway. When you see this sign, you are on the right track.","After a few km you pass a small Orang Asli village. The road can be muddy and slippery, in which case a 4WD is needed","Take the left turn at this junction and you are almost there. The trail goes down very steeply, take care.","The trail ends at the waterfall. The pool can be crossed to reach a camp site","The waterfall is impressive and very scenic. Must be powerful in the rainy season.","A good place for meditation.","The pool is shallow and not dangerous, a nice playing ground for the local boys","Ginger flowers","The Upper Sg Dua Fall","Update January 2009","The upper Sg Dua fall during our last visit","The middle Sg Dua falls"],"imgFullResFilename":["khong09.JPG","khong04.JPG","lata_karl-1.jpg","khong07.JPG","khong02.JPG","khong00.gif","P1260063.JPG","khong06.JPG","khong08.JPG","khong05.JPG","khong03.JPG","sg_dua_.jpg","khong01.JPG"]},"url":"91khong.php"}