{"name":"Mahua Fall","description":"Leaving Tambunan in the direction of Ranau, you will reach Kg Patau after 10 or 15 minutes and see a sign post indicating a left turn to the Mahua Waterfall. (If you come from Kota Kinabalu, it would be about a 1 ½ hour ride). After making that turn, you trundle along a dirt road for 6 km. The first stretch of the road is in relatively good condition, but it gets trickier the farther in you go. My guess is that an ordinary car would encounter difficulties in wet weather. We were in a 4WD, but because it was not one of those rugged 4 x 4 work horses, we did experience some sticky moments. Eventually, we came to a large clearing along which a river rushed. This marked the end of the road. The track was rather muddy and to avoid getting our vehicle stuck, we walked the rest of the way in to the Mahua Sub-station which had been financed by the Japan International Co-operational Agency (JICA). A friendly caretaker there maintains an office and collects an entrance fee of RM3 per person. For that fee, you also get to use the extremely clean toilets. The 500 metre walk along a distinct and well-maintained trail to the waterfall is an extremely pleasant stroll through a secondary forest of dipterocarp trees, undergrowth, ferns, shrubs and bamboo dense enough to shut out most of the sun’s heat. Butterflies, mainly the Tufted Jungle King, fluttering along the trail added flashes of colour to the otherwise intense green of the forest.Two tributaries, the Sg Lobou and the Sg Kulanggi gush down as little waterfalls of their own to join the main river which is never out of sight or earshot.Sungai Kulanggi At the end of the trail, the Mahua Waterfall tumbles down in an agitated vertical column of water, sending up a continuous misty spray as it crashes into the pool below. The height of the Fall is uncertain. One source puts it as 9 metres, another 15 metres and yet another 17 metres. I’m not sure, too, whether the small pool is safe for swimming but I can imagine that the strong currents stirred up by the Fall would put paid to all such intentions.Shelters and benches are provided for picnickers. There were, however, only four other people besides us that day we went. Difficulty of access has probably discouraged many people from visiting the Fall which is not a bad thing considering the difficulty of maintaining cleanliness in the face of large crowds.Several species of butterflies – a Monster Skipper, Black-Veined Mapwings, Blue Hedges, a Rajah Brooke’s Birdwing, a Red Helen and a Common Mormon – flitted about the pool area, congregating to share a drink.Although this was not a very extensive area, we surprised ourselves by spending about two hours there. Obviously, there is more to the Mahua Waterfall than what meets the eye.Check if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Sabah","location":{"verbatimCoordinates":"5.7968369, 116.4084633","verbatimLatitude":"5.7968369","verbatimLongitude":"116.4084633","decimalLatitude":5.79684,"decimalLongitude":116.40846,"decimalCoordinates":"5.79684,116.40846"},"coordinates":"5.7968369, 116.4084633","waterSource":"River","waterfallProfile":"Vertical Fall","accessibility":"6 km along a dirt road followed by an easy 15 minute walk","imgDetails":{"imgFilename":["TNmahua01.jpg","TNmahua02.jpg","TNmahua03.jpg","TNmahua04.jpg","TNmahua05.jpg","TNmahua06.jpg","TNmahua07.jpg","TNmahua08.jpg","TNmahua09.jpg","TNmahua12.jpg","TNmahua11.jpg","TNmahua10.jpg","TNmahua13.jpg","TNmahua14.jpg","TNmahua15.jpg","TNmahua17.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua01.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua02.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua03.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua04.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua05.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua06.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua07.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua08.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua09.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua12.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua11.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua10.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua13.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua14.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua15.jpg","http://waterfallsofmalaysia.com/images/106mahua/tn/TNmahua17.jpg"],"imgDesc":["Passing by a village on the dirt road to the Mahua Fall. Notice the pine tree.","The road ends here. Because it was muddy, we parked and walked in to the Mahua Sub-station which you can see in the far distance.","The trail to the waterfall. This is so well-marked and well-kept that it will be impossible to get lost.","The river which runs by the trail.","Another view of the river.","Sungai Lobou","Sungai Kulanggi  ","Some parts of the trail are cemented for easy access.","The dense dipterocarp forest through which the trail passes.","The fall becomes visible","The Mahua Fall","The fall in all its glory","People pictured here to put the Mahua Fall in perspective","Around the Fall area are shelters, benches and picnic tables for picnickers","The river just below the Fall.","Butterflies wetting their whistles at the water-soaked ground. Seen here are a Monster Slipper, Black-Veined Mapwings and Blue Hedges."," Thanks to Ang Yian Tze and Peter Chin, for providing the description and the pictures."],"imgFullResFilename":["mahua02.jpg","mahua11.jpg","mahua04.jpg","mahua09.jpg","mahua13.jpg","mahua17.jpg","mahua14.jpg","mahua06.jpg","mahua12.jpg","mahua08.jpg","mahua05.jpg","mahua01.jpg","mahua15.jpg","mahua10.jpg","mahua07.jpg","mahua03.jpg"]},"url":"106mahua.php"}