{"name":"Pisang Waterfall","description":"A Quiet Beautiful DropYou follow a broad gorge now and at the end of it the beautiful 20 meter drop greets you and invites you for a refreshing swim. You can even hide behind the falling water! On your way back you will find a steep trail to your left climbing up the gorge. It leads to the top of the fall (nice view!) and a campsite, which can be crowded on weekends.Archived Page AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Selangor","location":{"verbatimCoordinates":"N 03 19.010' E 101 43.966'","verbatimLatitude":"N 03 19.010'","verbatimLongitude":"E 101 43.966'","decimalLatitude":3.31683,"decimalLongitude":101.73277,"decimalCoordinates":"3.31683,101.73277"},"coordinates":"N 03 19.010' E 101 43.966'","waterSource":"Stream","waterfallProfile":"Vertical","accessibility":"Short River & Jungle Trek","imgDetails":{"imgFilename":["TNpisang02.JPG","TNpisang03.JPG","TNpisang04.JPG","TNpisang05.JPG","TNpisang06.JPG","TNpisang07.JPG","TNpisang08.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang02.JPG","http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang03.JPG","http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang04.JPG","http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang05.JPG","http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang06.JPG","http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang07.JPG","http://waterfallsofmalaysia.com/images/50pisang/tn/TNpisang08.JPG"],"imgDesc":["When people are using the Karak Highway, not many of them realise that there is a nice waterfall located along the highway, not far from KL. It is even possible to park the car at a lay-by and walk from there in 15 minutes to the Pisang Fall. However, you will then miss the experience of an adventurous river crossing and a nice jungle trek. ","For this nice adventure trek you start from the old Gombak Road to Genting. At km 11 you will find a signboard to the Jungle Lodge, where you can park your car. Follow the road until the fence of the Pumphouse. Enter trough the small gate and ask permission to proceed to the waterfall.","Follow the trail along the Gombak River until you reach the Karak Highway high above you. The Sungei Pisang flows through twin tunnels underneath this highway. To reach the tunnel you first will have to cross the Gombak river. This can be a wet experience in the rainy season!"," You can pass the tunnel by wading through the water or walking on the side ledges. ","After the tunnel you follow the river for a few hundred meters until a confluence. This is nice forest (and leech country in the rainy season). At the confluence pick the small stream on the right. There is even a \"roadsign\" in red paint....","From here it is a 30 minute walk to the fall. Just keep following the river, there are trails on both riverbanks. After some distance a wider trail splits off to the left. It leaves the river and leads to the campsite at the top of the fall."],"imgFullResFilename":["pisang02.JPG","pisang08.JPG","pisang05.JPG","pisang07.JPG","pisang00.gif","pisang04.JPG","pisang06.JPG","pisang03.JPG"]},"url":"50pisang.php"}