{"name":"Powerful Seminyang","description":"A large and spectacular cousin of the Buaya SangkutThe road from Karak to Kuala Pilah skirts the eastern slopes of the Titiwangsa Range. This is a region of orchards where rambutans, mangostans and durians are cultivated. In the same region also several waterfalls can be found. The orchard owners may not have been there. Jungles and forest - they don't take any fancy for what is within them. Their knowledge on falls is only hearsay, and you will be disappointed if you were to seek their assistance to learn more about the fall that you are searching. Although the track is maintained, it is only navigable by a normal car up to 5 kilometers of the way. On this stretch, the track passes through rubber estates and durian plantations. Finally when all these are left behind, the track winds through primary forest. After passing an Orang Asli settlement the track condition gets worse and a 4WD is advisable. Because the river makes a turn here, a better view of the fall can be obtained after crossing the river. This, however, is not always possible because of the strength of the current.Take good care about flash flooding! This is not a playground waterfall.When we visited the fall, the current was too strong to cross. We could scramble up the rocks until halfway, where the view was also very impressive.. Archived Page AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Pahang","location":{"verbatimCoordinates":"N 03 16.748' E 102 01.992'","verbatimLatitude":"N 03 16.748'","verbatimLongitude":"E 102 01.992'","decimalLatitude":3.27913,"decimalLongitude":102.0332,"decimalCoordinates":"3.27913,102.0332"},"coordinates":"N 03 16.748' E 102 01.992'","waterSource":"River","waterfallProfile":"Vertical Waterfall ","accessibility":"4WD track and hike","imgDetails":{"imgFilename":["TNsem18.JPG","TNsem01.JPG","TNsem02.JPG","TNsem16.JPG","TNsem17.JPG","TNsem05.JPG","TNsem06.JPG","TNsem08.JPG","TNsem10.JPG","TNsem11.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem18.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem01.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem02.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem16.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem17.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem05.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem06.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem08.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem10.JPG","http://waterfallsofmalaysia.com/images/65seminyang/tn/TNsem11.JPG"],"imgDesc":["The road from Karak to Kuala Pilah skirts the eastern slopes of the Titiwangsa Range.  This is a region of orchards where rambutans, mangostans and durians are cultivated. In the same region also several waterfalls can be found. The orchard owners may not have been there. Jungles and forest - they don't take any fancy for what is within them. Their knowledge on falls is only hearsay, and you will be disappointed if you were to seek their assistance to learn more about the fall that you are searching. ","To reach the fall, follow the road from Karak to Kuala Pilah for about 12 kmBefore reaching the village of Telemong, the road crosses a river named Perdak. Just after the bridge, there is a turning to the right. A laterite track will take you to the fall.This track was made for the Mini Hydro Power station and its employees utilize the track to commute to work. You will be guided by the power cables to reach the Station.","Although the track is maintained, it is only navigable by a normal car up to 5 kilometers of the way. On this stretch, the track passes through rubber estates and durian plantations.  Finally when all these are left behind, the track winds through primary forest. After passing an Orang Asli settlement the track condition gets worse and a 4WD is advisable. ","From the Station you still have another 3 kilometer of hike with 4 short climbs interspersed with level stretches. Continuing on the track, the next scene is that of the water catchments for the power station. A small path turns off to the right to reach into the ravine where the rapids are dammed."," Continue the track. Very soon, at a point where the track is seen really leading uphill continuously, look for a trail on the right. This is a visible path on level ground heading right towards the direction of the river.","After following this trail for about 600 meters through damp forest, you will reach the river. From here on the trail gets vague. If the waterlevel permits it, wade through the river, otherwise you have to scramble along the river bank."," Then, after another 300 meters, around the corner there it isThe Lata Seminyang, powerful and roaring ","there it is"],"imgFullResFilename":["sem18.JPG","sem10.JPG","sem06.JPG","sem11.JPG","sem01.JPG","sem08.JPG","sem02.JPG","sem16.JPG","sem05.JPG","sem17.JPG","sem00.gif"]},"url":"65seminyang.php"}