{"name":"Sendat Falls","description":"Just outside Ulu Yam Baharu, a 4 km dirt road runs into the forest reserve. This road ends at a ramshackle bridge where you can park the car. From there it is a short walk to the fallsThe Sendat falls consists of two tiers. The falls are located in a very shaded forest, very suitable to have a picknick on a hot day. There are some more small cataracts.The upper part of the Sendat FallArchived page availableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments1. Entrance per adult is RM2 and children if Im not mistaken.2. the entry signboard says RM5 per adult for camping, but the ranger who were guarding the entrance dont accept payment for camp, they only accept entrance. We stil have to pay for entrance even though we were planning to camp. The ranger said there will be another ranger in charge of camping activities inside.3. Before we set up the camp side, we looked for the ranger who are in charge of camp activities but no where to be found. So we asked the ranger who was sitting at the toilet entrance, he said, for camp will be charge per tent RM5 per night. but since he was not the person in charge so we left and just set up our camp side.4. the camp side provided is very well maintained, camp side is on the right side of the park so its not on the waterfall side. daytime, those who with families might picnic here and use the camp side, maybe because at the waterfall side most of the time is crowded with people and less dry and flat land that are suitable for kids.5. night time, it was just us and a group of 4 wheelers camped there. and the ranger who are in charge of camp activities are no where to be found so we camped there without any fee.6. public toilet will only be open from 8am to 5pm. So if you are not so comfortable doing business in the wild or changing clothes, do it before they closed.7. Im not sure about surau on what time they will closed, I just prayed at my camp side as it was easily to be done there due to there's alot of clean, dry and flat land to pray.8. If you are expecting people selling foods and drinks there, you better not. Not all the time motorbike food seller will be there. From what I saw, there was seller who sells Sate Ikan and ice cream. So its better to bring enough foods and beverages on your own.9. even though it was nicely developed, the parking compound was pitch black during night time. No security guards or any rangers during night time. It is advisable to do rounding and check your vehicle. Theres a small land where you can park your car in the camp site, I cant explain where, but the entrance to the small land parking lot is nearby the main entrance, near the titi kayu where the rangers will collect entrance fee.10. during night time, beware of stray dogs. we saw a few times a group of stray dogs running around, howling, fighting nearby our camp side but fortunately they dont kacau us and we dont kacau them.I guess, thats it I can share for now. look forward to camp here again in near future :)","state":"Selangor","location":{"verbatimCoordinates":"N03 24.21' E101 41.19'","verbatimLatitude":"N03 24.21'","verbatimLongitude":"E101 41.19'","decimalLatitude":3.4035,"decimalLongitude":101.6865,"decimalCoordinates":"3.4035,101.6865"},"coordinates":"N03 24.21'  E101 41.19'","waterSource":"River","waterfallProfile":"Near vertical Falls","accessibility":"Dirt road and some walking","imgDetails":{"imgFilename":["TNsendat01.JPG","TNsendat02.JPG","TNsendat03.JPG","TNsendat04.JPG","TNsendat05.jpg","TNsendat06.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/04sendat/tn/TNsendat01.JPG","http://waterfallsofmalaysia.com/images/04sendat/tn/TNsendat02.JPG","http://waterfallsofmalaysia.com/images/04sendat/tn/TNsendat03.JPG","http://waterfallsofmalaysia.com/images/04sendat/tn/TNsendat04.JPG","http://waterfallsofmalaysia.com/images/04sendat/tn/TNsendat05.jpg","http://waterfallsofmalaysia.com/images/04sendat/tn/TNsendat06.JPG"],"imgDesc":["This signboard shows the way to the forest reserve","It is advisable to park your car, and walk from here to the fall..:-)","We found many species of ginger flowers during our visit","The main fall with a nice pool.","One of the smaller cascades."],"imgFullResFilename":["sendat00.gif","sendat01.JPG","sendat02.JPG","sendat05.jpg","sendat06.JPG","sendat03.JPG","sendat04.JPG"]},"url":"04sendat.php"}