{"name":"Setinggi waterfall","description":"Serendah Waterfall is a small waterfall near Serendah Town. Many enjoys bringing their families for a picnic at this Recreational Park. But not many knows that there's another waterfall in the same region. The Setinggi Waterfall is located not too far from the Serendah Falls. Before reaching the Serendah Town, there's a traffic light that leads you to the Klinik Kesihatan. Take a right turn to the Klinik Kesihatan. And follow the road.Take the road heading up. You may opt to park your car before the construction site and walk or drive.(not for Sedan car owners that treats their cars like wife). You will come to a split. Take the right split heading down. From there you can see a vege farm on your right. After the vege farm. You will see 2 factories. One on your left and one on the right. You will see a trail continuing to the forest. Follow the trail for about 100meters. Then you will see a fork on your left. Take this fork to the left. In about 200 meters you will come to the Rubber Plantation. Just continue to walk on the main trail. At times, you could see plenty wild boars footprints. Continue the trekking on the main trail for about 750 meters, where the wide trail starts to climb. A trail, very vague at first, leads to the left (N03 20.60' E101 38.13') The trail itself is clear but it will look like it has not been visited for some time. Ferns on the trails a little overgrown. Just continue the walk until you see another bridge. From the bridge you could see the main falls about 200 meters away. Scramble up to the falls from the trail on the right. Do not attempt to climb up the slippery rocky surface of the lower falls. The trail on the right will lead you to the upper part of the falls. A pristine falls that you will usually have it by yourself with just 1.5-2hrs hike. From another angleCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Selangor","location":{"verbatimCoordinates":"N 03 20.63' E 101 38.41'","verbatimLatitude":"N 03 20.63'","verbatimLongitude":"E 101 38.41'","decimalLatitude":3.34383,"decimalLongitude":101.64017,"decimalCoordinates":"3.34383,101.64017"},"coordinates":"N 03 20.63'   E 101 38.41'","waterSource":"River","waterfallProfile":"Near Vertical fall","accessibility":"Trekking","imgDetails":{"imgFilename":["TNDSC_6756-1.JPG","TNDSC_6685.JPG","TNDSC_6755.JPG","TNDSC_6754.JPG","TNDSC_6689.JPG","TNDSC_6694.JPG","TNDSC_6743.JPG","TNDSC_6695.JPG","TNDSC_6742.jpg","TNDSC_6729.jpg","TNDSC_6696.jpg","TNIMG_3552.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6756-1.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6685.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6755.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6754.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6689.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6694.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6743.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6695.JPG","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6742.jpg","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6729.jpg","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNDSC_6696.jpg","http://waterfallsofmalaysia.com/images/149setinggi/tn/TNIMG_3552.jpg"],"imgDesc":["One of the Signboard at the roadside that leads to the construction site before the trail head","A beautiful fishing pond","The road on the right heads to the construction site (which in future will be houses)","Rubber Plantation. A mozzy plantation (at times you might probably have 10 mosquitoes chasing you)","A nice view of the greenery in Serendah","Follow the main trail. A broken concrete bridge after an hour walk. A small falls on your right where you could take a break before continuing.","Lower part of the falls","A bigger picture of the lower part of the falls.. A nice twin fall","the main falls is noticeable from here","The Main Setinggi Waterfall","A nice place for hydro massage"],"imgFullResFilename":["setinggi00.JPG","DSC_6685.JPG","DSC_6756-1.JPG","DSC_6729.jpg","IMG_3552.jpg","DSC_6696.jpg","DSC_6755.JPG","DSC_6695.JPG","DSC_6754.JPG","DSC_6689.JPG","DSC_6742.jpg","DSC_6743.JPG","DSC_6694.JPG"]},"url":"149setinggi.php"}