{"name":"Sg Salan Fall","description":"To reach the turning to the 4WD track head, use the East Coast expressway and Exit on 98 that leads to Jerantut. Turn Right on Road 98. Follow the road for 50km and turn right on Road 64. Turn left to Kuala Tahan Road. Turn right after 1km. You will see an abandoned stall (pic). Turn in to the Palm oil plantation. A road leading uphill is visible. The road is not accessable by 4WD as some irresponsible has dug a hole that it will be difficult for 4WD to cross. Hence you will have to continue on foot from there. Follow the road leading uphill. On the first split, take left. You will see marking on the split. You will need to cross 2 bridge made by logs. At the second split, you will see a vague road ahead. Take the right turn. Follow the road for less than 200meters you will reach the campsite.To head to Sg Salan waterfalls, from the campsite, go straight, there will be 2 trails. One heads to the river. Another on your left. Follow the left. And it will bring you to the other side of the river. Cross the river. Clear markings along the way. Approximately 10 mins you will find there’s marking on the right heading uphill and marking heading straight. Go straight. According to locals the marking on the right leads to a waterfall that locals name it Lata Manik. Due to time factor, we did not manage to explore further during our visit. We will keep you posted once we manage to explore this place.There will be 4 river crossings. At the last river cross, you will cross using big huge logs which fell across the river. Before crossing, take a look on the trees opposite. There’s a tree with a huge bees nest. That should be the reason why locals name it Lata Lebah (Bee’s Falls).There’s a campsite after this crossing. Take the trail on your right. Follow the trail for approximately 20 minutes. Beware of slippery rocks. After a total of 3hrs hike, the nice reward of the beautiful sight of the waterfall awaits you. There’s a double Olympic size pool at the bottom of the fall. But please do not attempt to swim. The current is very strong and the pool is very deep. Check out this video |heading_8|","state":"Pahang","location":{"verbatimCoordinates":"N4 0.956 E102 28.205","verbatimLatitude":"N4 0.956","verbatimLongitude":"E102 28.205","decimalLatitude":4.01593,"decimalLongitude":102.47008,"decimalCoordinates":"4.01593,102.47008"},"coordinates":"N4 0.956 E102 28.205","waterSource":"River","waterfallProfile":"Near Vertical Fall","accessibility":"4WD and Trekking","imgDetails":{"imgFilename":["TNP9050001.JPG","TNP9050032.JPG","TNP9050005.JPG","TNP9050035.JPG","TNP9050039.JPG","TNP9050047.JPG","TNP9060075.JPG","TNP9060077.JPG","TNP9070085.JPG","TNP9070100.JPG","TNP9070101.JPG","TNP9070143.JPG","TNP9070137.JPG","TNP9070109.JPG","TNP9070115.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/145salan/tn/TNP9050001.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9050032.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9050005.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9050035.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9050039.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9050047.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9060075.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9060077.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070085.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070100.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070101.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070143.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070137.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070109.JPG","http://waterfallsofmalaysia.com/images/145salan/tn/TNP9070115.JPG"],"imgDesc":["The signboard Turning to Taman Negara, Kuala Tahan.","The abandoned Stall at the road side on your right if you are coming from Jerantut. Be alert of this turning. Easily missed.","NOTE: If you see this, you have passed the 4wd track head. The signboards states Kg Paya Garuk. Back track for approx 200 meters.","A 4WD Trail Leading Uphill","A unique tall tree along the 4wd track. (Hopefully it's not cut down when you are visiting this place).","2 similar bridges made with logs to cross.","The Campsite which fits more than 100 people","Nice river by the campsite. Doubt there are logging in the upper stream, but we had \"teh tarik\" river.","The night falls and the jungle becomes alive with the natural musical instruments of Mother Nature.","From the campsite a trail leads to the other side of the river. Cross the river.","Cross to the opposite side of the river. ","A group of whitish furry insect. ","Here's where you will need to walk on the tree logs to cross the river. Try looking up on one of the trees. A huge Bees' nest is there.","A Small fall before we reach the main one","And finally after 3hours of searching...here we are. The Sg. Salan Waterfall."],"imgFullResFilename":["salan00.JPG","P9050005.JPG","P9070137.JPG","P9050001.JPG","P9070143.JPG","P9070109.JPG","P9070085.JPG","P9050039.JPG","P9070115.JPG","P9070101.JPG","P9070100.JPG","P9050032.JPG","P9050035.JPG","P9060075.JPG","P9060077.JPG","P9050047.JPG"]},"url":"145salan.php"}