{"name":"Strata Falls","description":"North of Tanjung Malim several small rivers flow down from the slopes of Gunung Behrang. One of them, Sungei Sekiah, has a number of attractive waterfalls, which have been named the Strata Falls. To reach them, go to Tanjung Malim and follow the directions for Kg Behrang Hulu and Proton City. After passing Proton City, look for a junction with a signboard to Diamond Creeks, a country resort. After 3 km you will reach the gate of this resort, where you must ask the security guards permission to visit the waterfall. Continue the road until the end. Here the trail starts, first through neglected palm oil plantations.There are many trails, so finding your way can be a bit complicated. On the map a few junctions are indicated. Basically you keep the stream to your right. The wide track becomes a small trail, sometimes quite overgrown. We visited the falls two times, via different routes. First we continued the trail as far as we could, until we could hear the sound of a waterfall deep down.At our next visit we decided to follow the stream. At the second 'fork left' on the map, we went right and arrived at the stream. In the first part there were still vague traces of trails. As the stream runs more or less parallel to the trail, there are a few other places where you can start following the river. The easiest access to the river is about 250 meter further, as shown on the map, where you can actually see the river from the trail.Throughout the ages the river has eroded a deep ravine. Sometimes there was no other way than just wading through the water. This is a place to be extremely careful. Not only because the rocks are slippery, but this place is prone to flash flooding. The many remains of sometimes huge trees give an impression of how powerful and dangerous the stream can then become.River trekking is always slow. It took us more than one hour, but finally we arrived at the main Strata Fall. An impressive two-tier fall with beautiful pools. The upper falls are not more than 200 meter upstream, but we could not find an easy way to climb up from here.This beautiful set of waterfalls is still virtually unknown. The setting is pristine and trekking to the falls an adventure. Even here, however, some of the few visitors have already left a plastic bottle here, a food container there, some wrappings, etc. And it is such a simple rule: Check if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Perak","location":{"verbatimCoordinates":"N03 45.83' E101 32.97'","verbatimLatitude":"N03 45.83'","verbatimLongitude":"E101 32.97'","decimalLatitude":3.76383,"decimalLongitude":101.5495,"decimalCoordinates":"3.76383,101.5495"},"coordinates":"N03 45.83'  E101 32.97'","waterSource":"River","waterfallProfile":"Vertical Falls, Cascades","accessibility":"Trekking","imgDetails":{"imgFilename":["TNstrata01.JPG","TNstrata02.JPG","TNstrata03.JPG","TNstrata04.JPG","TNstrata05.JPG","TNstrata06.JPG","TNstrata07.JPG","TNstrata08.JPG","TNstrata09.JPG","TNstrata10.JPG","TNstrata11.JPG","TNstrata12.JPG","TNstrata13.JPG","TNstrata14.JPG","TNstrata16.JPG","TNstrata17.JPG","TNstrata18.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata01.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata02.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata03.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata04.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata05.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata06.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata07.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata08.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata09.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata10.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata11.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata12.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata13.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata14.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata16.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata17.JPG","http://waterfallsofmalaysia.com/images/102strata/tn/TNstrata18.JPG"],"imgDesc":["Take this road to the Diamond Creeks Resort","The entrance gate of the resort.","When you see this bridge, you are on the right track!","The trail becomes more vague and sometimes overgrown.","Here the trail seems to end at an attractive waterfall in a tributary stream. However, scrambling up the other side (parang useful), we found that the trail continues.","Hearing the sound of a waterfall, we scrambled down the slopes and found the first tier of the upper Strata Fall.","The upper tiers of the fall","To reach these falls, we had to scramble down a steep slope, without any traces of a trail. These upper falls have several tiers and there were some nice pools. As we had no time to explore the region, we decided to come back another time.","The top fall. But there might be more falls upstream.","Soon after trekking along the river, you come across this nice cascade.","Further upstream there are several small falls, some with deep pools. The trail along the slope is only 50 meters away here.","Several times you had to cross the stream","The tree in the foreground has been swept away by the water.","Slippery rocks! The best way to proceed is the Orang Asli way, barefoot.","No idea who has apparently cut this giant tree.","The lower tier in the foreground.","The main fall. In the rainy season it will be even more impressive.","The upper part is a vertical fall.","\"Take only pictures, leave only footprints\" "],"imgFullResFilename":["strata00.gif","strata08.JPG","strata06.JPG","strata09.JPG","strata03.JPG","strata18.JPG","strata07.JPG","strata05.JPG","strata02.JPG","strata10.JPG","strata12.JPG","strata01.JPG","strata04.JPG","strata14.JPG","strata17.JPG","strata11.JPG","strata16.JPG","strata13.JPG"]},"url":"102strata.php"}