{"name":"Tarun Falls","description":"Tarun falls is a tall 2 levels waterfall within rock cliff surroundings. The misty upper level features a 2 tier cascade with a vertical drop of water into a rocky narrow riverbed. The lower level is a single drop into a large pool. A beautiful spot that is spoilt by the presence of messy piping trunks to tap water for human activities.Local resort operators may occasionally organize abseiling activities here. There have been instances where low rainfall coupled with the high amount of water being siphoned left only trickling water levels.Head to Semenyih then Broga town as the landmark. From Semenyih, visitors will pass a small bridge before approaching the access road on the left. The access road is BEFORE the Kg Baru Broga village gate.(refer ) This access will pass an orang asli village before arriving at Paradise Valley Broga Resort.There is plenty of parking space near the resort and opposite a local restaurant. Large groups are advised to be considerate and carpool instead of occupying most of the parking space as the area is popular during the weekend lunch crowd.Access trail starts from 2°56'43.0\"N 101°54'44.3\"E. Proceed on the main trail and follow the trail that pass a small cement bridge across the river. There are plenty of jungle trails here and it can be confusing. Keep right at the Y-junction and continue following the trail to the falls. The hike will take no longer than 20mins.Image 1.\"Rubbish exist when there is an imbalance of those willing to take action.\"If you plan to visit this waterfall, do bring a plastic bag along. In the event there is rubbish left by irresponsible individuals, you can contribute and do our part to keep nature's paradise clean.Thank you~ ","state":"Selangor","location":{"verbatimCoordinates":"2.95178, 101.91422","verbatimLatitude":"2.95178","verbatimLongitude":"101.91422","decimalLatitude":2.95178,"decimalLongitude":101.91422,"decimalCoordinates":"2.95178,101.91422"},"coordinates":"2.95178, 101.91422","waterSource":"Sg. Tarun, Natural Stream","waterfallProfile":"2 Levels Vertical Cascade Falls, with Pool","accessibility":"Trekking, <1 hour","imgDetails":{"imgFilename":["TNdsc04062-dsc04071web.jpg","TNscreenshot(603).png","TNtarunfallwidefinalresizedweb.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/181Tarun/tn/TNdsc04062-dsc04071web.jpg","http://waterfallsofmalaysia.com/images/181Tarun/tn/TNscreenshot(603).png","http://waterfallsofmalaysia.com/images/181Tarun/tn/TNtarunfallwidefinalresizedweb.jpg"],"imgDesc":["Tarun Upper Fall","Image 1.","Tarun Upper Fall Wide Scene"],"imgFullResFilename":["screenshot(602).png","tarunfallwidefinalresizedweb.jpg","dsc04062-dsc04071web.jpg","screenshot(603).png"]},"url":"181Tarun.php"}