{"name":"Trong Fall","description":"Rural MalaysiaThe river flows in a deeply eroded ravine. You can hear the water but not see it. The jungle around is attractive and unspoilt.After climbing down the steps, there is a beautiful waterfallA powerful fall with a beautiful poolUpdate 16-7-2006: Upper Trong FallThe Upper Trong Fall is taller and more inposing than the Lower one. The pool is deep and the water is clear. A very unspoilt place. Keep it that way!The pool in front of the fall is really impressiveArchived page availableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Perak","location":{"verbatimCoordinates":"N04 41.52' E100 45.31'","verbatimLatitude":"N04 41.52'","verbatimLongitude":"E100 45.31'","decimalLatitude":4.692,"decimalLongitude":100.75517,"decimalCoordinates":"4.692,100.75517"},"coordinates":"N04 41.52'  E100 45.31'","waterSource":"River","waterfallProfile":"Vertical Falls","accessibility":"Steep steps down from carpark. For upper fall jungle trekking required","imgDetails":{"imgFilename":["TNtrong01.JPG","TNtrong02.JPG","TNtrong03.JPG","TNtrong04.JPG","TNtrong05.JPG","TNtrong06.JPG","TNtrong07.JPG","TNtrong08.JPG","TNtrong09.JPG","TNtrong10.JPG","TNtrong11.JPG","TNtrong12.jpg","TNtrong13.jpg","TNtrong14.jpg","TNtrong15.jpg","TNtrong16.jpg","TNtrong17.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong01.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong02.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong03.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong04.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong05.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong06.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong07.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong08.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong09.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong10.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong11.JPG","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong12.jpg","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong13.jpg","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong14.jpg","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong15.jpg","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong16.jpg","http://waterfallsofmalaysia.com/images/30trong/tn/TNtrong17.jpg"],"imgDesc":["The small village of Trong is located about 16 km south of Taiping on the road to Beruas. From there a small road leads in 6km to the waterfall. The condition of this road is reasonable. ","\n\t","There is no sign board for the waterfall itself, but there is a sign for the water treatment plant.","In this region many beautiful Malay houses can be found.","At this fork you must keep right","In the last part, the road becomes worse, but remains passable. It ends at small parking lot.","From the parking a flight of steps leads down to the waterfall","In the bottom part of the steps you must be careful, as the steps are slippery and no longer level.","The steps end at the remains of what must have been a water catchment. From here the waterfall is visible.","The water falls in two steps. In the background the main fall can be seen","The smaller fall looks almost manmade, but is a natural one","The Trong fall is a very attractive waterfall, almost vertical, and with a huge pool, very suitable for swimming and bathing. The fall is so powerful that a perpetual mist is formed above the pool. Because its location, deep in the ravine, there are no places for camping","From the parking place, a trail continues, but we had no time to explore where it leads. It will be interesting to explore the river further upstream."," The trail from the parking place leads in about 1-1.5 hour to the Upper Trong Fall. This is jungle trekking, be prepared for leeches. Generally the trail is clear, you can always hear the sound of the river on your left.","\n\t","On your way you pass majestic palm trees.","If this scares you, you can also climb down the small ravine.","A beautiful dipterocarp giant","From far away you can hear the fall already.","A nearly vertical fall"],"imgFullResFilename":["trong02.JPG","trong13.jpg","trong07.JPG","trong15.jpg","trong01.JPG","trong08.JPG","trong11.JPG","trong06.JPG","trong17.jpg","trong00.gif","trong04.JPG","trong12.jpg","trong14.jpg","trong16.jpg","trong05.JPG","trong03.JPG","trong10.JPG"]},"url":"30trong.php"}