{"name":"Yong Falls","description":"Hidden treasure on the slopes of Gunung BelumutThe water from the river is crystal clear and there were quite a number of visitors. You can follow a path along the stream for some distance. It is also possible to climb the mountain from here (guide compulsory).But there is more to see! We had heard about the Sg Yong falls nearby, and a stall owner could give us accurate directions. Not easy to find! After about 15 km from the main road, you will pass a bridge. Just after the bridge, do not turn right to the Park but go straight for 3.81 km, through palm oil plantations. Park your car and take the clear trail to the right.The Sg Yong falls consist of seven tiers. The falls go down a narrow gorge. Extreme care has to be taken, because the rocks are quite slipperyAs we visited these falls late in the afternoon, we had no time to visit all the tiers. It will be worth while to come back and explore the upper falls.At the Belumut Park, we were told that there are plans to open up these falls. So better hurry, so you can enjoy this pristine falls, before it is too late!Contributed by Faye: The campsite is not accessible by 4wd anymore. Someone dug a deep wide drainage across the dirt trail at the border of oil palm plantation. A electric parameter fence had been build around the oil palm plantation too. Followed the vague track on the right of the stream towards upper stream. Got to be very careful, as you need to cross a wet slippery rock surfaceUpper TierCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Johor","location":{"verbatimCoordinates":"N02 06.30' E103 32.20'","verbatimLatitude":"N02 06.30'","verbatimLongitude":"E103 32.20'","decimalLatitude":2.105,"decimalLongitude":103.53667,"decimalCoordinates":"2.105,103.53667"},"coordinates":"N02 06.30' E103 32.20'","waterSource":"Small River","waterfallProfile":"Vertical Falls","accessibility":"Trekking","imgDetails":{"imgFilename":["TNyong01.JPG","TNyong02.JPG","TNyong03.JPG","TNyong04.JPG","TNyong05.JPG","TNyong06.JPG","TNyong07.JPG","TNyong08.JPG","TNyong09.JPG","TNyong10.JPG","TNyong11.JPG","TNyong12.JPG","TNyong13.JPG","TNyong14.JPG","TNyong15.JPG","TN_2269580.jpg","TN_7255654.jpg","TN_7255659.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/100yong/tn/TNyong01.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong02.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong03.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong04.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong05.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong06.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong07.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong08.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong09.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong10.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong11.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong12.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong13.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong14.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TNyong15.JPG","http://waterfallsofmalaysia.com/images/100yong/tn/TN_2269580.jpg","http://waterfallsofmalaysia.com/images/100yong/tn/TN_7255654.jpg","http://waterfallsofmalaysia.com/images/100yong/tn/TN_7255659.jpg"],"imgDesc":[" The Gunung Belumut is an isolated mountain (1010 m) about 25 km east of Kluang. There is a well-maintained Recreational Forest on the slopes of the mountain, and the roadsign even annouces a waterfall there. But the river has not more than some attractive rapids. To go there, follow the road nr 50 from Kluang to Mersing for about 15 km and turn right. ","\n\t","The signboard to the non-existing Belumut waterfall","At the entrance of the Hutan Lipur","A children's playground, some food stalls, a ranger office, the park is well maintained","A pleasant place to spend a lazy day","The most waterfall-like place we have found.","On our way back we had an encounter with this beautiful, non-poisonous green snake.","Not easy to find your way in a palm oil plantation.","A good 4WD with an experienced driver may be able to cross this bridge","After about half an hour trek, you can go down to the first waterfall of the Yong river","Not everybody will be able to do this.","Using vague trails or scrambling up, you can reach the next tier","And on to the mext.","This fall ends in an olympic-size and deep pool","Impressive surroundings","A perfect place to cool down","Update 2012","The main Sungai Yong Fall","Lower Tier"],"imgFullResFilename":["yong13.JPG","yong04.JPG","yong08.JPG","_7255654.jpg","yong05.JPG","yong03.JPG","yong02.JPG","yong06.JPG","yong.gif","yong09.JPG","yong11.JPG","yong12.JPG","yong01.JPG","yong15.JPG","_2269580.jpg","yong07.JPG","yong14.JPG","yong10.JPG","_7255659.jpg"]},"url":"100yong.php"}