{"name":"Chelik Fall","description":"A few years ago a new road has been opened to the Cameron Highlands. It starts at Simpang Pulai, south of Ipoh and enters the Cameron Highlands at Kg Raja. From this road one of the tallest falls of Peninsular Malaysia can be easily reached. This fall, Chelik, is still almost completely unknown.About 17 km after passing the N-S highway, there is a very sharp bend in the road. In this bend a small road goes down into the valley to a few Orang Asli houses. Take this exit (be careful!) and park your car near the houses.The trail is slightly overgrown, a parang might come in handy. But the trail is clear and not steep. Just when you wonder where the waterfall could be, after a bend in the trail, you can spot it through the trees to your left. It becomes only visible at the last moment, so it is not easy to estimate how tall it is. But that it is tall, is very clear, it is not easy to take a picture of the complete fall.The lower partThere is no place to camp near the fall, and also there is not really a pool for swimming. We had no time to check if it was possible to climb up to the top of the fall. If possible at all, it will not be easy.Archived page avalaibleCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Perak","location":{"verbatimCoordinates":"N04 34.97' E101 16.61'","verbatimLatitude":"N04 34.97'","verbatimLongitude":"E101 16.61'","decimalLatitude":4.58283,"decimalLongitude":101.27683,"decimalCoordinates":"4.58283,101.27683"},"coordinates":"N04 34.97'  E101 16.61'","waterSource":"Stream","waterfallProfile":"Tall Vertical Fall","accessibility":"Trekking","imgDetails":{"imgFilename":["TNchelik01.JPG","TNchelik02.JPG","TNchelik03.JPG","TNchelik04.JPG","TNchelik05.JPG","TNchelik06.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/57chelik/tn/TNchelik01.JPG","http://waterfallsofmalaysia.com/images/57chelik/tn/TNchelik02.JPG","http://waterfallsofmalaysia.com/images/57chelik/tn/TNchelik03.JPG","http://waterfallsofmalaysia.com/images/57chelik/tn/TNchelik04.JPG","http://waterfallsofmalaysia.com/images/57chelik/tn/TNchelik05.JPG","http://waterfallsofmalaysia.com/images/57chelik/tn/TNchelik06.JPG"],"imgDesc":["When you ask for the waterfall here, they will show you the trail.","Of course the kids are curious","After a 45 minute trek: the waterfall","Only with a human figure in the picture the proportions become clear.","The upper part of the fall"],"imgFullResFilename":["chelik00.gif","chelik01.JPG","chelik06.JPG","chelik04.JPG","chelik02.JPG","chelik05.JPG","chelik03.JPG"]},"url":"57chelik.php"}