{"name":"Chiling Falls","description":"The Chiling Falls are probably the most beautiful waterfalls of Selangor. They can be reached after an adventurous trek along the river, which has to be crossed many times. To reach the trail head, you take the road from Kuala Kubu Baru to the Gap. After passing the Selangor Dam, you cross the bridge on the Chiling river. Just after this bridge you can park you car. Follow the road for about 100 meter, the trail head is clearly indicated. Soon you will arrive an open field beside the river, with some buildings and a campsite, maintained by the Fisheries department. At the moment, and temporarily, the Chiling falls are open to the public only from Friday until Sunday! The first river crossing is by means of a recently constructed suspension bridge. Strict rules have been introduced: after the bridge camping, fishing, making fires, etc is no more allowed. A good idea, in the past several fatal accidents have occured with flash-flooding. Hopefully the rangers will be able to maintain the place. The trail is clear and follows the river, but you have to cross the river five more times. So you must be prepared to get wet feet and probably more... Kampung Adidas are very useful here. After rainfall the water level can reach until your waist and the current can be strong. Take care, especially with children. After trekking for about one and a half hour, the river makes a right-turn and suddenly you will see the lower waterfall. A quite spectacular reward. It is a powerful fall with a large pool. Lots of fish, which like to nibble your feet..:-)There are two more falls. You reach them, by scrambling up the steep slope, just before the last river crossing. You will pass another waterfall (not accessible) before you reach the third waterfall. This place is much quieter than the lower fall and very well suited for a relaxed picnic.This is an interesting trek and a beautiful fall. But accidents have happened here, due to flash-flooding. Don't make this trip in adverse weather conditions! The river will become impassable when the water level is too high.Access to the Chiling falls is limited to weekends only (Fri, Sat, Sun), because of ongoing research by the Selangor fisheries department. If public holidays fall outside the weekend, access will in general not be possibleAfter some accidents have happened, the Fisheries Department has placed a signboard where the trail to the upper fall starts. So officially the upper falls are out of bounds nowTo visit Chiling you have to register at the counter (RM 1). Camp fee is RM 4 per tent. You have to pay a deposit of RM 50/150, depending on the group size. Refundable if you leave the campsite clean. Contactinformation. The 013 number belongs to Yusri, he will be able to tell more about opening timesAnotherfall,upstreamofthemainfallsArchived Pages AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Selangor","location":{"verbatimCoordinates":"N03° 35.71' E101° 45.05'","verbatimLatitude":"N03° 35.71'","verbatimLongitude":"E101° 45.05'","decimalLatitude":3.59517,"decimalLongitude":101.75083,"decimalCoordinates":"3.59517,101.75083"},"coordinates":"N03° 35.71' E101° 45.05'","waterSource":"River","waterfallProfile":"3 Vertical Waterfalls ","accessibility":"Hike and River Trek","imgDetails":{"imgFilename":["TNIMG_2066.JPG","TNP6240133.JPG","TNP9010007.JPG","TNP9010009.JPG","TNP9010015.JPG","TNIMG_2071.JPG","TNIMG_2076.JPG","TNP9010012.JPG","TNP9010013.JPG","TNIMG_2092.JPG","TNP9010021.JPG","TNIMG_0314_Don.JPG","TNIMG_2099.JPG","TN20070901_IMG_0413.jpg","TNIMG_2097.JPG","TNchiling_10.jpg","TNchiling_7.jpg","TNchiling_2.jpg","TN1-IMG_9744.JPG","TN1-IMG_9750.JPG","TN1-IMG_9756.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_2066.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP6240133.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP9010007.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP9010009.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP9010015.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_2071.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_2076.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP9010012.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP9010013.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_2092.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNP9010021.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_0314_Don.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_2099.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TN20070901_IMG_0413.jpg","http://waterfallsofmalaysia.com/images/51chiling/tn/TNIMG_2097.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TNchiling_10.jpg","http://waterfallsofmalaysia.com/images/51chiling/tn/TNchiling_7.jpg","http://waterfallsofmalaysia.com/images/51chiling/tn/TNchiling_2.jpg","http://waterfallsofmalaysia.com/images/51chiling/tn/TN1-IMG_9744.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TN1-IMG_9750.JPG","http://waterfallsofmalaysia.com/images/51chiling/tn/TN1-IMG_9756.JPG"],"imgDesc":["At the moment, and temporarily, the Chiling falls are  open to the public only from Friday until Sunday! ","You can park just after this bridge","The start of the trail is clearly indicated","Ranger's hut and campsite","The suspension bridge","Strict rules!","Beautiful orchids!","An easy and clear trail","Crossing the river","Five crossings in total","A powerful waterfall","With a large pool","Impressive. Picture by Don Aitken","Picture by Don Aitken","The second fall","The river above the two falls with the upper fall in the backgroundPicture by Gabriel Chong","Picture by Gabriel Chong","The upper Fall","Update May 2011","Limited opening times!","Research is going on","Ikan Kelah","Update August 2015","Contact information. The 013 number belongs to Yusri, he will be able to tell more about opening times","Boundary of the Fish Sanctuary"],"imgFullResFilename":["P9010012.JPG","P6240133.JPG","P9010021.JPG","P9010007.JPG","IMG_2066.JPG","IMG_2076.JPG","P9010013.JPG","chiling_10.jpg","P9010015.JPG","20070901_IMG_0413.jpg","P9010009.JPG","IMG_2099.JPG","IMG_0314_Don.JPG","IMG_2092.JPG","IMG_2071.JPG","gpsdata.gif","chiling_2.jpg","1-IMG_9750.JPG","IMG_2097.JPG","1-IMG_9744.JPG","1-IMG_9756.JPG","chiling_7.jpg"]},"url":"51chiling.php"}