{"name":"Genuai Fall","description":" is a near vertical horsetail fall estimated to be about 8m tall with a small shallow pool in rocky steep cliff surroundings. The fall and lower cascades are more interesting during wet seasons.Genuai FallVisitors from the north can head to Damak town; while from the south, head to Kuala Krau town. The road conditions are good and can be accessed by normal sedan car. Proceed to Kg. Pian which is an orang asli village. It is not signposted so visitors can use the location 3°47'32.7\"N 102°14'06.1\"E as guide. There is a junction going into the village to the large & unkept football field.(ref ) Park at the edge of the field without obstructing the path. Large groups are advised to speak to local village head for permission.The trail starts from the goalpost going thru a rubber estate towards the inner oil palm estate. Follow the clear trail in and take the right junction going towards the river.(ref ) By the river there is a wooden house, circle around and look for the river crossing to the opposite side. There is a visible trail going into the jungle. River trek following the river till you reach a section of steep rocky cascades.(ref ) Scale this rocky and steep section carefully, the waterfall is at the peak. It is advisable to engage a guide to visit this fall.Image 1Image 2Image 3The fall has a rather narrow space with few spots for resting. Not much to do other than enjoying a shower & soaking in the view.P.S. Watch out for the small ants here as they bite! There are plenty of them as well and seems to be crawling everywhere :(\"Rubbish exist when there is an imbalance of those willing to take action.\"If you plan to visit this waterfall, do bring a plastic bag along. In the event there is rubbish left by irresponsible individuals, you can contribute and do our part to keep nature's paradise clean.Thank you~ ","state":"Pahang","location":{"verbatimCoordinates":"3.79229, 102.24422","verbatimLatitude":"3.79229","verbatimLongitude":"102.24422","decimalLatitude":3.79229,"decimalLongitude":102.24422,"decimalCoordinates":"3.79229,102.24422"},"coordinates":"3.79229, 102.24422","waterSource":"Sg. Genuai, Natural Stream","waterfallProfile":"Near Vertical, Single Drop, No Pool","accessibility":"Trekking, <1 hour","imgDetails":{"imgFilename":["TNgenuaifallsportraitpanofinalresizedweb.jpg","TNscreenshot(629).png","TN20220326_1107202884244269122832260_large.jpg","TN20220326_1039213394802837239072938_large.jpg","TNgenuaifallswidepanofinalresizedweb.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/186Genuai/tn/TNgenuaifallsportraitpanofinalresizedweb.jpg","http://waterfallsofmalaysia.com/images/186Genuai/tn/TNscreenshot(629).png","http://waterfallsofmalaysia.com/images/186Genuai/tn/TN20220326_1107202884244269122832260_large.jpg","http://waterfallsofmalaysia.com/images/186Genuai/tn/TN20220326_1039213394802837239072938_large.jpg","http://waterfallsofmalaysia.com/images/186Genuai/tn/TNgenuaifallswidepanofinalresizedweb.jpg"],"imgDesc":["Genuai Fall","Image 1","Image 2","Image 3","Genuai Fall Wide Scene"],"imgFullResFilename":["screenshot(629).png","genuaifallsportraitpanofinalresizedweb.jpg","screenshot(627).png","20220326_1107202884244269122832260_large.jpg","20220326_1039213394802837239072938_large.jpg","genuaifallswidepanofinalresizedweb.jpg"]},"url":"186Genuai.php"}