{"name":"Gepai Falls","description":"Small attractive waterfall near BidorA pleasant spot for an afternoon bathA pool with deep, clear and cool waterClimbing up At the right side of the fall you can climb up the rocks. Be careful after rain, the rocks can be slippery. From the top of the fall you have a nice view of the crowd below. The water really has to force it way down between te huge boulders! The Gepai Waterfall may not be spectacular or impressive, the location and the quality of the water make it a rewarding target for a Sunday afternoon.Archived Page AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Perak","location":{"verbatimCoordinates":"N04° 07.19' E 101° 19.87'","verbatimLatitude":"N04° 07.19'","verbatimLongitude":"E 101° 19.87'","decimalLatitude":4.11983,"decimalLongitude":101.33117,"decimalCoordinates":"4.11983,101.33117"},"coordinates":"N04° 07.19'  E 101° 19.87'","waterSource":"Stream","waterfallProfile":"Vertical","accessibility":"Carpark near Fall","imgDetails":{"imgFilename":["TNgepai01.JPG","TNgepai02.JPG","TNgepai03.JPG","TNgepai04.JPG","TNgepai05.JPG","TNgepai06.JPG","TNgepai07.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai01.JPG","http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai02.JPG","http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai03.JPG","http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai04.JPG","http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai05.JPG","http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai06.JPG","http://waterfallsofmalaysia.com/images/28gepai/tn/TNgepai07.JPG"],"imgDesc":["To reach the Gepai Waterfall, you take the Bidor exit of the North-South Expressway.Just before reaching Bidor, turn right into a small road, Jalan Paku. This road passes farmland and a Chinese cemetery, crosses under the Expressway and ends after about 6 km at a the waterfall. You can park your car here.","The waterfall is not signposted but well known with the locals, so it can be crowded in weekends. From the carpark you can cross the stream on a small bridge. This bridge is a favourite spot to dive down in the cool, clear water below.","The water is crystal clear and cool. Although the stream is a small one, the waterfall looks powerful because the water is foced through a narrow opening in the rocks. ","Some daredevils even jump from the rocks in the deep pool","At the right side of the fall you can climb up the rocks. Be careful after rain, the rocks can be slippery. From the top of the fall you have a nice view of the crowd below.  The water really has to force it way down between te huge boulders!","There is another smaller waterfall, which is much less crowded and forms a perfect location for relaxing. From here you can follow the river upstream through unspoilt forest. Your effort may even be rewarded with a few more small waterfalls."],"imgFullResFilename":["gepai01.JPG","gepai05.JPG","gepai07.JPG","gepai06.JPG","gepai00.gif","gepai04.JPG","gepai03.JPG","gepai02.JPG"]},"url":"28gepai.php"}