{"name":"Lata Hammers","description":"Access to this beautiful, unknown, waterfall is from the old Gombak-Bentong road. Coming from KL by the Karak highway, you take the exit to the village of Bukit Tinggi, where you can have breakfast. Then you follow the old road to Bentong for about 16 km. On your way you pass a nice unnamed waterfall and a Hot Springs.From the junction a small road leads in about 3 km to the resort. The quality of this access road was reasonable during our visit. Should be possible with a normal car, although a 4WD might come in handy during the rainy season.The trail is well maintained, at some places a bit overgrown. Follow it for another 2 km (half an hour). The river is always audible down in the ravine to your right. During our visit the location where you start the descent to the river, was indicated by an arrow, made of tree braches and twigs. Take care, this descent is very steep!This waterfall is one of the most beautiful that can be found near KL. The water volume is high, even in the dry season and the pool is huge. There are several suitable campsites around. A vague trail to the right of the fall leads to the upper fall, which is more modest, but also has a nice pool. Upstream the river becomes quiet.This waterfall is a relatively unknown and therefore unspoilt gem, quite near KL. Keep it that way! Take only pictures, leave only footprints.Check if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Pahang","location":{"verbatimCoordinates":"N03 27.41' E101 51.85'","verbatimLatitude":"N03 27.41'","verbatimLongitude":"E101 51.85'","decimalLatitude":3.45683,"decimalLongitude":101.86417,"decimalCoordinates":"3.45683,101.86417"},"coordinates":"N03 27.41'  E101 51.85'","waterSource":"Small River","waterfallProfile":"Vertical Falls","accessibility":"Trekking along trail","imgDetails":{"imgFilename":["TNhammers01.JPG","TNhammers02.JPG","TNhammers03.JPG","TNhammers04.JPG","TNhammers05.JPG","TNhammers06.JPG","TNhammers07.JPG","TNhammers08.JPG","TNhammers09.JPG","TNhammers10.JPG","TNhammers11.JPG","TNhammers12.JPG","TNhammers13.JPG","TNhammers14.JPG","TNhammers15.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers01.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers02.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers03.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers04.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers05.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers06.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers07.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers08.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers09.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers10.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers11.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers12.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers13.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers14.JPG","http://waterfallsofmalaysia.com/images/104hammers/tn/TNhammers15.JPG"],"imgDesc":["This nice unnamed waterfall can be seen from the road. Will be powerful in the rainy season.","The Hot Springs look grand, but are now in a bit of disrepair.","This signboard marks the access road to the resort and the waterfall","Near the unfinished house you can park your car and start trekking","First you have to cross the river.","After the crossing you follow a well-maintained trail","The start of the scramble down to the river. Notice the arrow.","The steepest part of the descent. A fixed rope is helpful","At the bottom, the waterfall and the huge pool come as a big suprise.","You have to cross the river to reach the 'beach'","The Hammers waterfall in all its beauty","Driftwood trees show that in the rainy season this fall will be much more powerful.","The upper fall","Wild orchids can be found here","It might be interesting to explore the stream further uphill"],"imgFullResFilename":["hammers00.gif","hammers02.JPG","hammers03.JPG","hammers04.JPG","hammers05.JPG","hammers11.JPG","hammers08.JPG","hammers01.JPG","hammers15.JPG","hammers07.JPG","hammers09.JPG","hammers06.JPG","hammers12.JPG","hammers13.JPG","hammers10.JPG","hammers14.JPG"]},"url":"104hammers.php"}