{"name":"Lata Cemerong","description":"A Remote, Very Tall Fall The Lower FallsThe trail uphillThe Upper FallThe upper part of the fallFrom the bottom of the fall it is not possible to climb to the top. Maybe the top can be reached by crossing the new bridge, and following the trail to the Gunung Berumbun. Archived Page AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Terengganu","location":{"verbatimCoordinates":"N 4° 39.60' E 103° 0.05'","verbatimLatitude":"N 4° 39.60'","verbatimLongitude":"E 103° 0.05'","decimalLatitude":4.66,"decimalLongitude":103.00083,"decimalCoordinates":"4.66,103.00083"},"coordinates":"N 4°  39.60'  E 103° 0.05'","waterSource":"River","waterfallProfile":"Near Vertical Fall","accessibility":"Recreation Park","imgDetails":{"imgFilename":["TNcemerong02.jpg","TNIMG_3653.jpg","TNcemerong05.JPG","TNcemerong08.JPG","TNcemerong09.JPG","TNcemerong07.JPG","TNIMG_3658.jpg","TNIMG_3696.jpg","TNIMG_3698.jpg","TNIMG_3671.jpg","TNIMG_3673.jpg","TNIMG_3682.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/72cemerong/tn/TNcemerong02.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3653.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNcemerong05.JPG","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNcemerong08.JPG","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNcemerong09.JPG","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNcemerong07.JPG","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3658.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3696.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3698.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3671.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3673.jpg","http://waterfallsofmalaysia.com/images/72cemerong/tn/TNIMG_3682.jpg"],"imgDesc":["Reaching the Cemerong fall is quite an expedition because of its remoteness and lack of signage.From Kuantan you follow the Inland Highway to Kuala Terengganu. About halfway you will pass a small river, the Paka river. Take the first road to your left. Coordinates of the junction are N 04° 35.854' E 103° 12.542' From this junction it is about 30 km on a good tar road to the Entrance of the Recreation Park.From the coastal Highway you can cross over to the Inland one at Kemanan or Dungun ","\n\t","From ver far away, the waterfall is already visible above the palm oil plantations.","The park has undergone an intensive renovation and now even has showers!","The main fall is not visible from the park, but there is a small attractive waterfall with a nice pool"," Near to the carpark, a trail follows the river downhill. Hidden in thick forest you will find a few very attractive waterfalls in a steep ravine (be careful!). There is a nice place to camp nearby.","\n\t","It is possible to camp at the lower fall","This waterfall is difficult to access.","Impressive buttressed trees along the path uphill"," At the left side of the Lower Fall a trail starts uphill. In the beginning it is cemented. The stream is very quiet here and there are beautiful buttressed trees. Do NOT cross the stream on the new over-sized bridge. Keep following the left side of the stream. The trail becomes less easy, but a suspension bridge and ropes help a lot.","\n\t","The trail at the other side of the river leads to the top of Gunung Berumbun","Some parts of the trail are steep","This old suspension bridge looks frail, but is still reliable"," After about 1.5 hour you reach the bottom of the upper fall. And an impressive fall it is. Difficult to estimate the height, must be more than 250 meter. ","\n\t","The very tall Cemerong Fall. Notice the human figure at the bottom of the fall","Really impressive!"],"imgFullResFilename":["cemerong02.jpg","cemerong08.JPG","cemerong05.JPG","cemerong09.JPG","cemerong00.jpg","IMG_3653.jpg","IMG_3682.jpg","cemerong07.JPG","IMG_3673.jpg","IMG_3698.jpg","IMG_3658.jpg","IMG_3696.jpg","IMG_3671.jpg"]},"url":"72cemerong.php"}