{"name":"Latak Falls","description":"The Lambir Hills National Park is located about 30 km south of Miri and a popular weekend destination for the Miri people.The sandstone hills rise to a height of 465m and there is an extensive trail-system (colored paint dots). Latak falls is the tallest and biggest of the waterfalls in the park. They are also the most easily accessible being only a 20 minute walk away from the Park HQ. Despite its accessibility and popularity with Miri people, Latak has the distinction of being the cleanest and most litter –free recreation site in Malaysia and comparable to the best in Europe or Australia (at least at the time of writing). Congratulations to the Park staff and local population.A visit to Latak is 3 falls for the price of 1. The walk starts at the Park kiosk and crosses over an impressively sturdy wooden bridge and then follows the side of the stream. Presently there is a temporary detour (it has been there for 3 years) until the suspension bridge is replaced. The facilities are good and, unlike some Peninsula waterfalls (e.g. Sendat), the toilets are set well back from the falls and picnic site and the litter bins are emptied regularly. Just before the second falls is the turn off (to the left) up to the observation tower and some of the other waterfalls, such as Nibong, This is also the trail to Bukit Lambir. Trails are quite wide and the signs are good however day-trippers should not attempt these unless properly equipped and shod. Unless you have experience sleeping out in the jungle at night it is best to start early in the day. Thanks to Ash for the pictures and description","state":"Sarawak","location":{"verbatimCoordinates":"4.204577, 114.036897","verbatimLatitude":"4.204577","verbatimLongitude":"114.036897","decimalLatitude":4.20458,"decimalLongitude":114.0369,"decimalCoordinates":"4.20458,114.0369"},"coordinates":"4.204577, 114.036897","waterSource":"Stream","waterfallProfile":"Vertical Fall","accessibility":"Easy walk from parking","imgDetails":{"imgFilename":["TNlambir01.JPG","TNlambir02.JPG","TNlatak01.jpg","TNlatak02.jpg","TNlatak03.jpg","TNlatak04.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/116latak/tn/TNlambir01.JPG","http://waterfallsofmalaysia.com/images/116latak/tn/TNlambir02.JPG","http://waterfallsofmalaysia.com/images/116latak/tn/TNlatak01.jpg","http://waterfallsofmalaysia.com/images/116latak/tn/TNlatak02.jpg","http://waterfallsofmalaysia.com/images/116latak/tn/TNlatak03.jpg","http://waterfallsofmalaysia.com/images/116latak/tn/TNlatak04.jpg"],"imgDesc":["The signboard for Lambir Hills N.P.","Trail map of the park. The closed part is now open again!","Entrance of the Main Trail","The first waterfall is found on the right hand side of the path shortly after it passes over the rocky stream bed. From now on the stream mostly runs over solid rock.","The second and smallest of the falls is just under another wooden bridge which allows you to look down on and photograph the lunar landscape of the river bed which features moon craters caused by the circular motion of pebbles wearing out the river bed over hundreds if not thousands of years.","The main fall is visible soon after crossing this bridge. It is a respectable drop well over 20 metres high with a good flow of water. The plunge pool is large and there is a roped off section for children and inexperienced swimmers to. Do note that people have drowned although it is quite easy for a strong swimmer to swim to the ledge under the fall where you can stand. "],"imgFullResFilename":["latak02.jpg","lambir02.JPG","latak03.jpg","lambir01.JPG","latak04.jpg","latak01.jpg"]},"url":"116latak.php"}