{"name":"Lata Mengkuang","description":"Lata Mengkuang is located about 12 km from Sik off the road from Sik to Baling. From the road you can see the recreation area, which only attracts visitors during weekends. To reach the waterfall, take the tar road to the left just before you reach the Recreation area. After less than 1 km there is a gate where you can park your car. From there walk along the road for a few hundred meters to the fall.We liked the quiet atmosphereof Lata Mengkuang. During our visit there was not a lot of water, as it was the dry season. The waterflow will be much stronger during the monsoon.After the cascades there is one almost vertical fall with a nice pool.When you are travelling in this remote part of Kedah and have time to spare, a visit to this waterfall is highly recommended.Archived page availableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Kedah","location":{"verbatimCoordinates":"N05 51.99' E100 50.21'","verbatimLatitude":"N05 51.99'","verbatimLongitude":"E100 50.21'","decimalLatitude":5.8665,"decimalLongitude":100.83683,"decimalCoordinates":"5.8665,100.83683"},"coordinates":"N05 51.99' E100 50.21'","waterSource":"Small river","waterfallProfile":"Cascade & Vertical Fall","accessibility":"From carpark","imgDetails":{"imgFilename":["TNmengkuang01.JPG","TNmengkuang02.JPG","TNmengkuang03.JPG","TNmengkuang04.JPG","TNmengkuang05.JPG","TNmengkuang06.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/75mengkuang/tn/TNmengkuang01.JPG","http://waterfallsofmalaysia.com/images/75mengkuang/tn/TNmengkuang02.JPG","http://waterfallsofmalaysia.com/images/75mengkuang/tn/TNmengkuang03.JPG","http://waterfallsofmalaysia.com/images/75mengkuang/tn/TNmengkuang04.JPG","http://waterfallsofmalaysia.com/images/75mengkuang/tn/TNmengkuang05.JPG","http://waterfallsofmalaysia.com/images/75mengkuang/tn/TNmengkuang06.JPG"],"imgDesc":["The recreation area along Sg Chepir is well maintained, but a bit desolate","During weekends it will be more busy.","At the end of the road it is not far to the main cascades of Mengkuang","An advantage of the dry season: you can easily climb the rocks.","There are several places where you can take a nice shower"],"imgFullResFilename":["mengkuang00.gif","mengkuang03.JPG","mengkuang02.JPG","mengkuang04.JPG","mengkuang05.JPG","mengkuang06.JPG","mengkuang01.JPG"]},"url":"75mengkuang.php"}