{"name":"Lata Yuk","description":"Most people know about Lata Kinjang, the waterfall that can be seen from the North-South Highway. That this waterfall has a small brother is not well known. The Lata Yuk falls are located less than 500 meters from Lata Kinjang. Just before reaching the Kinjang hawker stalls, a small road to the right leads to an Orang Asli kampung. About 500 meter after the Orang Asli village, you should reach the lower Yuk fall. This is more like a cascade. Unspoilt and no rubbish yet. Keep it that way!When we visited this fall, it was already late in the afternoon, so we had not much time to explore. There should be more cascades and falls in the upper region. This time we wanted to explore the upper reaches of Lata Yuk. It had been raining a lot and the waterfalls were powerful. We started from the Orang Asli village and soon reached the lower fall. Kids were having fun in the water. We could not find a trail along the river, so we followed first the trail to Kinjang, and then found a trail that after a while joined the Yuk river again.It ended at a few waterfalls and finally at a dam, there must have been a water reservoir in the past. On our way back, we scrambled down a steep slope and found the main cascade, a smaller version of the big Kinjang one.This time we missed the fall just above the lower fall (with the big pool), so we must come again.Part of the middle cascadeArchived page availableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Perak","location":{"verbatimCoordinates":"N04 18.00' E101 15.58'","verbatimLatitude":"N04 18.00'","verbatimLongitude":"E101 15.58'","decimalLatitude":4.3,"decimalLongitude":101.25967,"decimalCoordinates":"4.3,101.25967"},"coordinates":"N04 18.00'  E101 15.58'","waterSource":"Stream","waterfallProfile":"Cascades, Vertical Falls","accessibility":"Trekking from carpark","imgDetails":{"imgFilename":["TNyuk01.JPG","TNyuk02.JPG","TNyuk03.JPG","TNyuk04.JPG","TNyuk05.JPG","TNyukmap.jpg","TNPA260006.JPG","TNPA260012.JPG","TNPA260014.JPG","TNPA260015.JPG","TNPA260026.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/67yuk/tn/TNyuk01.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNyuk02.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNyuk03.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNyuk04.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNyuk05.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNyukmap.jpg","http://waterfallsofmalaysia.com/images/67yuk/tn/TNPA260006.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNPA260012.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNPA260014.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNPA260015.JPG","http://waterfallsofmalaysia.com/images/67yuk/tn/TNPA260026.JPG"],"imgDesc":["Friendly kids in the Orang Asli kampung","At the end of this kampung, take one of the trails that follow the river. Orientation is not easy in these abandoned rubber plantations, try to keep close to the stream. ","Some trees are still being tapped","The lower Yuk cascade","A vague trail to the right site brings you to the upper fall.","This is a real fall with a nice swimmingpool","Update October 2008","The trails superimposed on GE","Large flow of water after heavy rain","Fun for the kids","Upper Yuk falls","The dam is visible at the top of the picture"],"imgFullResFilename":["yuk02.JPG","PA260006.JPG","PA260012.JPG","kinjang00.gif","yuk05.JPG","PA260014.JPG","yukmap.jpg","yuk03.JPG","PA260026.JPG","yuk01.JPG","yuk04.JPG","PA260015.JPG"]},"url":"67yuk.php"}