{"name":"Lon Waterfall in Virgin Forest","description":"SereneJungleWaterfalls is an interesting pastime. In fact we look forward toseeing those waterfalls that we have yet to visited, just likecompleting a collection. So contended to be there. Then therewill come a day when you wish you could invent your verywaterfalls. Sungei Lon is just one of those days!Thetown of Sungkai is a small place with hardly enough shop house tocomplete one street. This is the town where the massive SungkaiRiver flows Where there is a catchments, there will be crystal clear water and waterfalls. True enough, this is one long cascade dropping about 10 meters.We were more overwhelmed by the beauty of the surrounding forest rather than the waterfall. The flow of the stream before the waterfalls was reduced to meandering speed within a fairly wide gorge.This was one day for the flora! Mushrooms, Ginger flowers and large varieties of wild flowers.We were quite contended with the spin off from these waterfall hunt- to learn how to enjoy nature!","state":"falls \n            for the adventurousWaterfalls adventurous","location":"","coordinates":"     for the adventurousWaterfalls adventurous","waterSource":"     map we picked this tributary at random and as luck was\n        with us, a solitary road leads to the water catchment's area.  Where there is a catchments, there will be crystal\n        clear water and waterfalls.  True enough, this is one long\n        cascade dropping about 10 meters.","waterfallProfile":"beautiful waterfall. Frequent flash flood helped to\n        shape the left bank very evenly and tidily for a large\n        resting area under the shade.We were more\n        overwhelmed by the beauty of the surrounding forest\n        rather than the waterfall.","accessibility":"     here [species not confirmed] have myriads aerial roots\n        dangling over the stretch of river banks above the\n        Waterfall area.  The flow of the stream before the\n        waterfalls was reduced to meandering speed within a\n        fairly wide gorge. This was one day for the flora!\n        Mushrooms, Ginger flowers and large varieties of wild\n        flowers.","imgDetails":{"imgFilename":["headfall.jpg","headfall.jpg","headfall.jpg","n55lrapid.jpg","n55lkhoojungle.jpg","n55lginger.jpg","n55lswim.jpg"],"imgUrl":["headfall.jpg","headfall.jpg","headfall.jpg","n55lrapid.jpg","n55lkhoojungle.jpg","n55lginger.jpg","n55lswim.jpg"],"imgDesc":["The Lon Rapids-  Serene Jungle","The ","Lon"," Rapids- "," ","Serene Jungle","Visiting","\nWaterfalls is an interesting pastime. In fact we look forward to\nseeing those waterfalls that we have yet to visited, just like\ncompleting a collection. So contended to be there. Then there\nwill come a day when you wish you could invent your very\nwaterfalls. Sungei Lon is just one of those days!","The\ntown of Sungkai is a small place with hardly enough shop house to\ncomplete one street. This is the town where the massive Sungkai\nRiver flows"],"imgFullResFilename":[]},"url":"Nfalls/txn55lond.php"}