{"name":"Madai Fall","description":"There are 3 ways to come to Madai Falls which is located near Kunak town. If you're coming from Tawau, head towards the Lahad Datu - Semporna junction(30 minutes-2 lane road). Turn towards Lahad Datu and just drive straight.You will pass by palm oil estates on both sides with Sime Darby Plantation the most visible one. It takes about 40 minutes of driving to reach the junction to Kunak town. Don't turn into Kunak town!! Just keep going straight and head towards Lahad Datu. Ten minutes later, on your right you will see Pusat Sejadi Hutan Simpan Madai Baturong Kunak.Pay an entrance fee of RM2.00 and a short walk down the staircase will bring you to the awesome Madai Fall. The park is quite small but well maintained with restroom and shower facilities.It can get crowded during weekends because of the easy accessibility. The water is brownish in colour, however the source of the waterfall is clean and clear. The pool size is not too big - suitable for picnics with young kids but near the drop it is quite deep.Try to get behind the waterfall because it's an amazing sight with the water curtain and the green moss behind. You can walk around the pool to get there or simply swim. ","state":"Sabah","location":{"verbatimCoordinates":"N 4° 45.09' E 118° 6.94'","verbatimLatitude":"N 4° 45.09'","verbatimLongitude":"E 118° 6.94'","decimalLatitude":4.7515,"decimalLongitude":118.11567,"decimalCoordinates":"4.7515,118.11567"},"coordinates":"N 4° 45.09' E 118° 6.94'","waterSource":"Stream","waterfallProfile":"Vertical Fall","accessibility":"From car park","imgDetails":{"imgFilename":["TNIMG_5313.JPG","TNIMG_5226.JPG","TNIMG_5225.JPG","TNIMG_5227.JPG","TNIMG_5237.JPG","TNIMG_5239.JPG","TNIMG_5172.JPG","TNIMG_5194.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5313.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5226.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5225.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5227.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5237.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5239.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5172.JPG","http://waterfallsofmalaysia.com/images/140madai/tn/TNIMG_5194.JPG"],"imgDesc":["If you're coming from Tawau(after you've turned right from Tawau heading towards Lahad Datu)you will see this sign. ","After passing by Kunak town junction, drive for another 10 minutes, and you will see this bus stop on your right.","Behind the bus stop is the entrance to Madai Baturong Forest Reserve","Well maintained park ","The stairs leading to the falls. Only a one minute walk from the entrance","Steep down to the falls - 1 minute ","You will see the fall already halfway the stairs","The Madai Fall","Thanks to Teoh Yew Aun for pictures and description"],"imgFullResFilename":["madai00.JPG","IMG_5313.JPG","IMG_5226.JPG","IMG_5237.JPG","IMG_5172.JPG","IMG_5225.JPG","IMG_5239.JPG","IMG_5194.JPG","IMG_5227.JPG"]},"url":"140madai.php"}