{"name":"Stong waterfalls","description":"Stong Waterfall a.k.a Jelawang Waterfall is arguably one of the tallest waterfalls in Peninsular Malaysia. It can be seen from the roadside in Dabong. From KL you take the road from Kuala Lipis to Gua Musang. Then use road D241 to Dabong. Clear signboards lead to the Park. From the park, you can hire a guide to lead you to the Top of the Waterfalls. Follow the cemented steps, and it will lead you to the lower falls. Big pool but dangerous. There’s a nice bridge in front of the waterfalls. Cross the bridge and follow the clear trail that leads to the top. It’s a one and half hour rather steep hike with some climbing at the beginning of the trail.After 45 minutes hike you will reach a shelter. A trail on the left leads to the foot of the tall waterfall. Very spectacular.Backtrack to the shelter to continue the hike to the campsite. When you reach the top, there will be a sign to welcome you to the Baha’s Camp. On your right is the trail leading to Gunung Baha, Gunung Ayam and Gunung Stong.Sunrise at the campsite. On top of the waterfall, above the clouds, an unforgettable memory! A trail leads from the campsite to the Last Waterfall. This waterfall is where the rivers from Gunung Ayam and Gunung Stong join, forming Sg Jeri and the Stong Waterfalls. And this is a spectacular helicopter view of the Stong fallpicture courtesy of Lim Eng HooHere is a short video of the Stong fall|heading_8|Archived Page AvailableCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Kelantan","location":{"verbatimCoordinates":"N 5 20.43' E101 57.93'","verbatimLatitude":"N 5","verbatimLongitude":"20.43' E101 57.93'","decimalLatitude":5.3405,"decimalLongitude":101.9655,"decimalCoordinates":"5.3405,101.9655"},"coordinates":"N 5 20.43'  E101 57.93'","waterSource":"River","waterfallProfile":"Vertical","accessibility":"Trekking","imgDetails":{"imgFilename":["TNP8290006.JPG","TNP8290008.JPG","TNP8290014.JPG","TNP8290020.JPG","TNJelawang_11.jpg","TNP8290026.JPG","TNP8300106.JPG","TNP8300160.JPG","TNP8310211.JPG","TNstong_helicopter.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/148stong/tn/TNP8290006.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8290008.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8290014.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8290020.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNJelawang_11.jpg","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8290026.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8300106.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8300160.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNP8310211.JPG","http://waterfallsofmalaysia.com/images/148stong/tn/TNstong_helicopter.jpg"],"imgDesc":["Stong waterfall from the roadside","Clearly signposted","The Welcome signboard at the entrance to the park","The first waterfall around 250 m from the entrance","From the foot of Stong Waterfall. Standing Tall. (photo © Harry Nian)","A welcome sign that leads to the campiste","Sunrise at the campsite. On top of the waterfall, above the clouds, an unforgettable memory!\n","The waterfall at the campsite (picture taken after rain hence the water volume is high)","The Last Waterfall","And this is a spectacular helicopter view of the Stong fall\npicture courtesy of Lim Eng Hoo"],"imgFullResFilename":["stong00.JPG","P8310211.JPG","P8290020.JPG","P8290008.JPG","P8300160.JPG","P8290006.JPG","P8300106.JPG","P8290014.JPG","stong_helicopter.jpg","P8290026.JPG","Jelawang_11.jpg"]},"url":"148stong.php"}