{"name":"Takah Tinggi","description":"Unknown Endau RompinThe Endau Rompin National Park is the second largest national park in Peninsular Malaysia.Besides the main entrance, at Kg Peta, there is another entry point at Kg Selai for the southern regions of the park. In this relatively unknown part of Endau Rompin, there is a powerful waterfall, the Taka Tinggi. To reach Kg Selai, take the Yong Peng exit of the North-South Expressway, direction Labis and follow the signs for Bekok. Continue to the recreational park of Sungai Bantang, where you can organise transport to the park and guides. You can drive yourself to the base camp at Lubuk Tapah, but inside the park the tracks are bad and a 4WD is needed. After registration at the Ranger Station you will pass a few Orang Asli villages.From the Base Camp it is a 1-2 hour trek along the Selai river to reach the roaring fall. The track is well maintained and clean, difficult spots are provided with rope bridges. The fall can be heard before you see it, as it is around a corner.It is a big powerful fall, and the pool is not really inviting for a swim. To get a better view point, you have to cross the river. It is good that ropes have been provided for, otherwise it would be a risky adventure.Other Waterfalls in Endau Rompin Park (Selai)Takah Selow Fall and Takah Pandan Fall are the most popular waterfalls at Endau Rompin, Selai. Although they are easy access, you still need about 30 mins of jungle trekking to reach them. A guide is compulsory for all waterfalls in the park.The journey to  is the toughest trail in the park and packed with lots of leeches, compared with other waterfalls here. Before the body has warmed up, you have to start climbing up a steep slope. The whole journey is a lot of ups and downs. Ropes are fixed at some difficult parts .Takah BeranginTakah TempaangCheck if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Johore","location":{"verbatimCoordinates":"2.453470, 103.237680","verbatimLatitude":"2.453470","verbatimLongitude":"103.237680","decimalLatitude":2.45347,"decimalLongitude":103.23768,"decimalCoordinates":"2.45347,103.23768"},"coordinates":"2.453470, 103.237680","waterSource":"Sungai Selai","waterfallProfile":"Near Vertical Fall","accessibility":"National Park, trekking","imgDetails":{"imgFilename":["TNselai03.JPG","TNselai01.JPG","TNselai02.JPG","TNselai04.JPG","TNselai05.JPG","TNselai06.JPG","TNselai07.JPG","TNselai08.JPG","TNselai09.JPG","TNselai10.JPG","TNGE-map.JPG","TNselow.jpg","TNtakah-pandan.jpg","TNtakah-berangin.jpg","TNtempaang.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/85selai/tn/TNselai03.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai01.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai02.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai04.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai05.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai06.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai07.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai08.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai09.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselai10.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNGE-map.JPG","http://waterfallsofmalaysia.com/images/85selai/tn/TNselow.jpg","http://waterfallsofmalaysia.com/images/85selai/tn/TNtakah-pandan.jpg","http://waterfallsofmalaysia.com/images/85selai/tn/TNtakah-berangin.jpg","http://waterfallsofmalaysia.com/images/85selai/tn/TNtempaang.jpg"],"imgDesc":["The tracks can become very bad in the rainy season. When you reach the Selai river, you will be suprised by the nice and well maintained Base camp. There is also a campsite with a number of basic chalets, kitchen facilities, but you must bring your own food.","At the top of the fall there are more rapids. If you have time to explore, there are more waterfalls in the region. One of them, Takah Pandan, you can reach easily on your way back to the camp. This dreamlike fall invites you for a rewarding swim.","Update October 2012 by Faye","The waterfalls of Endau Rompin (Selai) The river is indicated in blue","Takah Selow Fall is a series of small waterfalls. It has 3 tiers of cascades.","The Takah Pandan Waterfall. It has a more than 50 m high vertical fall.","Takah Berangin","The least visited waterfall in the park is Takah Tempaang. In the same river (Sungai Tempaang) as Takah Berangin Fall. To access the waterfall, you need river trekking in the last part of the hike. It has a deep pool great for diving. "],"imgFullResFilename":["selai00.gif","selai10.JPG","selai07.JPG","selai08.JPG","selai05.JPG","tempaang.jpg","takah-berangin.jpg","selai02.JPG","GE-map.JPG","selai04.JPG","selai09.JPG","selai06.JPG","selow.jpg","selai01.JPG","takah-pandan.jpg","selai03.JPG"]},"url":"85selai.php"}