{"name":"Templer Falls","description":"Templer Falls is a 2-tier waterfall with many shallow cascade pools. The lower tier has a wide sandy pool while the top tier is a tall sloped cascade fall. Templer Fall is less popular compared to the nearby Kanching Falls, as the waterfall is not straightforward and requires visitors to hike along the mostly flat terrain riverside jungle trail over multiple bridges to reach. The hike is suitable for beginners and the waterfall is well worth the effort with crystal clear waters.Head to Rawang town as the landmark. The entrance to Templer Park is on the left of Jalan Rawang southbound to KL. Look out for the large signposted entry gate () which is the junction to turn into. There are plenty of parking spaces here and on weekends the riverside park can be crowded with families having a picnic.Proceed up the stairs and inside visitors will find a large deep swimming pool.() Currently the pool is drained and it is not known if the pool will be filled back up again. On the left there is a series of stairs that will lead to the old water catchment dam where the river trail starts.There are a number of river crossings but visitors will not need to wet their feet as there are either zig-zag or straight bridges constructed in the past that still holds up to this day. The jungle trail is clear and visitors will arrive at the waterfall in less than 1 hour.Image 1Image 2The final cascades are quite tall and at the top there are a few nice bathtub like pools, perfect for a relaxing bath.Templer Fall Wide Scene\"Rubbish exist when there is an imbalance of those willing to take action.\"If you plan to visit this waterfall, do bring a plastic bag along. In the event there is rubbish left by irresponsible individuals, you can contribute and do our part to keep nature's paradise clean.Thank you~ Check if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Selangor","location":{"verbatimCoordinates":"N03 17.60' E101 39.25'","verbatimLatitude":"N03 17.60'","verbatimLongitude":"E101 39.25'","decimalLatitude":3.29333,"decimalLongitude":101.65417,"decimalCoordinates":"3.29333,101.65417"},"coordinates":"N03 17.60'  E101 39.25'","waterSource":"Sg. Rangkap, Natural Stream","waterfallProfile":"2-Tier Cascade Falls","accessibility":"Trekking, <1 hour","imgDetails":{"imgFilename":["TNtemplerlowerfallsa7rfinalweb.jpg","TNscreenshot(707).png","TNtemplar02.jpg","TNtemplar04.jpg","TNuppertemplerfallaerial1web.jpg","TNtemplar08.jpg","TNtemplerupperfallwidepanoresizedweb.jpg"],"imgUrl":["http://waterfallsofmalaysia.com/images/02templar/tn/TNtemplerlowerfallsa7rfinalweb.jpg","http://waterfallsofmalaysia.com/images/02templar/tn/TNscreenshot(707).png","http://waterfallsofmalaysia.com/images/02templar/tn/TNtemplar02.jpg","http://waterfallsofmalaysia.com/images/02templar/tn/TNtemplar04.jpg","http://waterfallsofmalaysia.com/images/02templar/tn/TNuppertemplerfallaerial1web.jpg","http://waterfallsofmalaysia.com/images/02templar/tn/TNtemplar08.jpg","http://waterfallsofmalaysia.com/images/02templar/tn/TNtemplerupperfallwidepanoresizedweb.jpg"],"imgDesc":["Templer Fall (Lower Tier)","Image 1","Image 2","The bridges have been constructed with fantasy","An aerial view of the big cascade at the end","A view from the top of the cascade, down into the valley"],"imgFullResFilename":["screenshot(707).png","templar00.gif","uppertemplerfallaerial1web.jpg","templar02.jpg","templerlowerfallsa7rfinalweb.jpg","templar08.jpg","templerupperfallwidepanoresizedweb.jpg","templar04.jpg"]},"url":"02templar.php"}