{"name":"Usun Apau","description":"Although the format of this page is the usual one, the style will be a bit different, more personal, like a blog.I (the webmaster of this site) am fascinated by the Julan falls, as they are spectacular, remote and not often visited. And there are many more falls around the Usun Apu plateau, the Selio river region has been visited hardly at all.On this page as much information will be given (reports etc) as I have been able to collect, about the Usun Apau and its waterfalls.Sometimes I will use pictures taken by others, in which case I will give credits, where possible. Feel free to comment on this page, it is meant as a work in progress.NB Links will open in separate windows. To view Facebook reports, you will need a FB identity.More than three years ago, in December 2006, I have made a trip to the Kelabit Highlands in Sarawak. During my stay in the friendly Apple lodge in Ba' Kelalan, I found in the guesthouse library a book, \"The National Parks of Sarawak\", by Hans Hazebroek (a Dutchman ?).One (proposed) park immediately draw my attention, Usun Apau. The reason? A spectacular picture of the Julan waterfall, supposedly the highest waterfall of Sarawak. When I saw this picture (click for an enlargement), I was hooked. What a beautiful, impressive waterfall.I started asking around, to get more information about this waterfall. It was remote, few people had heard about it, nobody had been there. A Mulu guide I met in Bario, was interested and maybe could organise a trip.Back home, I continued collecting information. I found an Internet link to a trip, organised by the Miri HHH, many years ago. I heard the story about the Millionaire's club, a failed project to \"develop\" the Usun Apau plateau with a golf course and a luxury resort.A few months later I met Ashleigh, who had been traveling a lot in Sarawak, knew about the Julan fall and was interested to organise a MNS trip to the Usun Apau plateau.And I met Winda from Kuching, who had actually seen the waterfall, albeit from far away. Through her I came in contact with Dato Jacob Sagan, the originator of the Millionaire Club project.The Usun Apau plateau is located about 170 km SSE of Miri. It is an old volcanic plateau, near the Indonesian border, unknown until 1951, when Tom Harrison, the curator of the Sarawak Museum in Kuching, discovered it. The plateau is basically uninhabited because of its inaccessibility, with steep slopes, giving rise to spectacular waterfalls.On the north side of the plateau the Julan river and one of its tributaries form the Julan falls, before joining the Baram river. At the south side it is the Selio river with its tributaries, which flows in the Silat river and finally in the Baram river.The highest point of the plateau is formed by Bukit Selidang, the remnant of an old volcano.The Millionaire's Club was planned a few km away from the Western Fall. Construction started in 1984, but due to the economical situation, it was never completed. Not everybody was unhappy about this \"failure\", there were environmental concerns that the project might damage the pristine and unspoilt character of the Usun Apau plateau. See for example a report by Ashleigh or this report by Lelan.There are plans at the moment to revive the project, hopefully in an environmentally friendly way.In 2004 Chua Limbang, with Morrison as a guide, visited the Western Fall, using a logging road to access the plateau. His report, \"the Highest Waterfall Drop in Sarawak\", can be found hereThe picture below left, shows the top of the fall, with the water falling down vertically.A few months later, the Miri HHH group organised an expedition, not only to the Western fall, but even to the mountain Bukit Selidang, about 17 km south of the Julan fall!. A report of this expedition, again guided by Morrison, can be found here The Miri Hashers wrote an instructive report about this expedition,full of useful hints and advice, which can no longer be found on their own website but is available here, courtesy of the Miri HHH webmaster Ray Stringer.As far as I know, until now nobody has managed to access the base of this powerful waterfall. To scramble down from the top looks virtually impossible, the only alternative would be river trekking along the Julan river, also a formidable job According to a recent update the access logging road is not usable at the moment, due to landslides. But there are plans to repair this road.Infinity view from the top of Western JulanIn August 2009, Ashleigh and the MNS have organised a trip to the Eastern Julan fall, with Willie as their main guide. From Miri they drove with 4WD on logging roads until the Julan bridge, where they camped. From there they started trekking to the top of the Eastern fall, where they camped two nights, before coming down. From the top the view of the main fall is rather limited, but there is a beautiful upper tier. Picture reports are available, created by Ashleigh, Nomadtravels, Goon Hong and Clint Mills.In March 2010, Danny Voon followed basically the same route to the Eastern waterfall, using again Willie as his guide. With a few people of his group he managed to scramble down to the base of the fall, probably a first! From the picture it can be seen how powerful the fall is from this point of view.Picture reports have been created by Danny Voon and by Dr John YeoThe waterfalls in the Selio region are hardly known and even more remote than the Julan falls. I have found only one detailed report by Lahang, who has visited the Silat and Selio rivers in February 2009. His report contains directions how to go there. The trip from Long Bee along the Selio river took five days!A general report about the Usun Apau falls by Chua Limbang also contains some pictures of the Selio falls.Selio FallKotak fall|heading_8|Check if you need a permit before planning a waterfall trip. More information hereWaterfalls can be dangerous ! Always take care about your safetyVisitor Comments","state":"Sarawak","location":{"verbatimCoordinates":"N 3 1.76' E 114 38.98'","verbatimLatitude":"N 3 1.76'","verbatimLongitude":"E 114 38.98'","decimalLatitude":3.02933,"decimalLongitude":114.64967,"decimalCoordinates":"3.02933,114.64967"},"coordinates":"N 3 1.76'  E 114 38.98'","waterSource":"Rivers","waterfallProfile":"Vertical falls","accessibility":"Trekking","imgDetails":{"imgFilename":["TNjulan_hazebroek.JPG","TNusun_apau.JPG","TNeastern_julan.jpg","TNwestern_julan.jpg","TNIMG_9408_Chua.JPG","TNjulan_jee_mui_lan.jpg","TNJulan_GE.JPG","TNJulan_eastern_ash.jpg","TNeastern_julan_upper.jpg","TNJulan_eastern_danny.jpg","TNselio_GE.JPG","TNlower_selio_telangusan.JPG","TNselio_telangusan-1.jpg","TNkotak_telangusan.JPG"],"imgUrl":["http://waterfallsofmalaysia.com/images/141julan/tn/TNjulan_hazebroek.JPG","http://waterfallsofmalaysia.com/images/141julan/tn/TNusun_apau.JPG","http://waterfallsofmalaysia.com/images/141julan/tn/TNeastern_julan.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNwestern_julan.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNIMG_9408_Chua.JPG","http://waterfallsofmalaysia.com/images/141julan/tn/TNjulan_jee_mui_lan.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNJulan_GE.JPG","http://waterfallsofmalaysia.com/images/141julan/tn/TNJulan_eastern_ash.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNeastern_julan_upper.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNJulan_eastern_danny.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNselio_GE.JPG","http://waterfallsofmalaysia.com/images/141julan/tn/TNlower_selio_telangusan.JPG","http://waterfallsofmalaysia.com/images/141julan/tn/TNselio_telangusan-1.jpg","http://waterfallsofmalaysia.com/images/141julan/tn/TNkotak_telangusan.JPG"],"imgDesc":["Introduction","\nAlthough the format of this page is the usual one, the style will be a bit different, more personal, like a blog.I (the webmaster of this site) am fascinated by the Julan falls, as they are spectacular, remote and not often visited. And there are many more falls around the Usun Apu plateau, the Selio river region has been visited hardly at all.On this page as much information will be given (reports etc) as I have been able to collect, about the Usun Apau and its waterfalls.Sometimes I will use pictures taken by others, in which case I will give credits, where possible. \nFeel free to comment on this page, it is meant as a work in progress.\nNB Links will open in separate windows. To view Facebook reports, you will need a FB identity.\n","The (Western) Julan waterfall","More than three years ago, in December 2006, I have made a trip to the Kelabit Highlands  in Sarawak. During my stay in the friendly Apple lodge in Ba' Kelalan, I found in the guesthouse library a book, \"The National Parks of Sarawak\", by Hans Hazebroek (a Dutchman ?).","\nOne (proposed) park immediately draw my attention, Usun Apau. The reason? A spectacular picture of the Julan waterfall, supposedly the highest waterfall of Sarawak. When I saw this picture (click for an enlargement), I was hooked. What a beautiful, impressive waterfall.\n","\nI started asking around, to get more information about this waterfall. It was remote, few people had heard about it, nobody had been there. A Mulu guide I met in Bario, was interested and maybe could organise a trip.\n","\nBack home, I continued collecting information. I found an Internet link to a trip, organised by the Miri HHH, many years ago. I heard the story about the Millionaire's club, a failed project to \"develop\" the Usun Apau plateau with a golf course and a luxury resort.\n","\nA few months later I met Ashleigh, who had been traveling a lot in Sarawak, knew about the Julan fall and was interested to organise a MNS trip to the Usun Apau plateau.\n","And I met Winda from Kuching, who had actually seen the waterfall, albeit from far away. Through her I came in contact with Dato Jacob Sagan, the originator of the Millionaire Club project.\n","The Usun Apau plateau","\nThe Usun Apau plateau is located about 170 km SSE of Miri. It is an old volcanic plateau, near the Indonesian border, unknown until 1951, when Tom Harrison, the curator of the Sarawak Museum in Kuching, discovered it. The plateau is basically uninhabited because of its inaccessibility, with steep slopes, giving rise to spectacular waterfalls.On the north side of the plateau the Julan river and one of its tributaries form the Julan falls, before joining the Baram river. At the south side it is the Selio river with its tributaries, which flows in the Silat river and finally in the Baram river.\nThe highest point of the plateau is formed by Bukit Selidang, the remnant of an old volcano.\n\n\n","The Usun Apau plateau. A number of waterfalls is indicated, there must be many more. The Julan and Selio rivers are indicated in light-blue. The Selio river flows into the Silat river and finally in the Baram river. There are many more rivers originating on the plateau, but not shown on this map.","The Julan Falls","Eastern Julan Fall","The problem with the Julan falls is that there are more than one, and this can (and has!) lead to some confusion.When Dato Jacob Sagan started a project for a high-class resort on the plateau (the Millionaire's Club), he arranged for a professional photographer to take aerial pictures of the two main falls, from a helicopter. They are shown to the left and right. The one depicted in the National Parks of Sarawak book, is the Western Julan fall. The Eastern fall is located at a distance of about 3 km. It is actually a tributary of the Julan river and less powerful than the Western one","\nThe Millionaire's Club was planned a few km away from the Western Fall. Construction started in 1984, but due to the economical situation, it was never completed. Not everybody was unhappy about this \"failure\", there were environmental concerns that the project might damage the pristine and unspoilt character of the Usun Apau plateau. See for example a report by Ashleigh or this report by Lelan.","\nThere are plans at the moment to revive the project, hopefully in an environmentally friendly way.","Western Julan fall","The Western Julan Fall","\nIn 2004 Chua Limbang, with Morrison as a guide, visited the Western Fall, using a logging road to access the plateau. His report, \"the Highest Waterfall Drop in Sarawak\", can be found here\nThe picture below left, shows the top of the fall, with the water falling down vertically.\nA few months later, the Miri HHH group organised an expedition, not only to the Western fall, but even to the mountain Bukit Selidang, about 17 km south of the Julan fall!. A report of this expedition, again guided by Morrison, can be found here \nThe Miri Hashers wrote an instructive report about this expedition,full of useful hints and advice,  which can no longer be found on their own website but is available here, courtesy of the  Miri HHH webmaster Ray Stringer.","\nAs far as I know, until now nobody has managed to access the base of this powerful waterfall. To scramble down from the top looks virtually impossible, the only alternative would be river trekking along the Julan river, also a formidable job \n","According to a recent update the access logging road is not usable at the moment, due to landslides. But there are plans to repair this road.\n","Top of the Western Julan fall© Chua Limbang","© Chua Limbang","Infinity view from the top of Western Julan\n© Jee Mui Lan","© Jee Mui Lan","The Eastern Julan fall","In August 2009, Ashleigh and the MNS have organised a trip to the Eastern Julan fall, with Willie as their main guide. From Miri they drove with 4WD on logging roads until the Julan bridge, where they camped. From there they started trekking to the top of the Eastern fall, where they camped two nights, before coming down. From the top the view of the main fall is rather limited, but there is a beautiful upper tier. Picture reports are available, created by Ashleigh, Nomadtravels, Goon Hong and Clint Mills.\nIn March 2010, Danny Voon followed basically the same route to the Eastern waterfall, using again Willie as his guide. With a few people of his group he managed to scramble down to the base of the fall, probably a first! From the picture it can be seen how powerful the fall is from this point of view.\nPicture reports have been created by Danny Voon and by Dr John Yeo\n","The trail to the Eastern Julan, as recorded with GPS by the group of Ashleigh (green). The orientation of this Google Earth screen shot is towards the South. The Julan bridge base camp is in the lower left. The Julan river (Western fall) and its tributary (Eastern fall) are indicated in blue.","View down from the top of the Eastern fall© Ashleigh","© Ashleigh","The upper tier of Eastern Julan© Dr John Yeo","© Dr John Yeo","The Eastern fall, viewed from the base© Danny Voon","© Danny Voon","The Selio waterfalls","The waterfalls in  the Selio region are hardly known and even more remote than the Julan falls. I have found only one detailed report by Lahang, who has visited the Silat and Selio rivers in February 2009. His report contains directions how to go there. The trip from Long Bee along the Selio river took five days!\nA general report about the Usun Apau falls by Chua Limbang also contains some pictures of the Selio falls.\n\n","Google Earth screen shot of the upper Selio river with some of the waterfalls indicated in blue.","Lower Selio fall© Lahang","© Lahang","Selio Fall© Lahang","© Lahang","Kotak fall© Lahang"],"imgFullResFilename":["usun_apau.JPG","western_julan.jpg","eastern_julan.jpg","Julan_eastern_danny.jpg","Julan_eastern_ash.jpg","kotak_telangusan.JPG","julan_jee_mui_lan.jpg","selio_GE.JPG","lower_selio_telangusan.JPG","Julan_GE.JPG","selio_telangusan-1.jpg","eastern_julan_upper.jpg","julan_Topo.JPG","julan_hazebroek.JPG","IMG_9408_Chua.JPG"]},"url":"141julan.php"}